[{"model": "products.category", "pk": 1, "fields": {"name": "romance", "friendly_name": "Romance"}}, {"model": "products.category", "pk": 2, "fields": {"name": "mystery", "friendly_name": "Mystery"}}, {"model": "products.category", "pk": 3, "fields": {"name": "fiction", "friendly_name": "Fiction"}}, {"model": "products.category", "pk": 4, "fields": {"name": "nonfiction", "friendly_name": "Nonfiction"}}, {"model": "products.category", "pk": 5, "fields": {"name": "young_adult", "friendly_name": "Young Adult"}}, {"model": "products.category", "pk": 6, "fields": {"name": "classics", "friendly_name": "Classics"}}, {"model": "products.category", "pk": 7, "fields": {"name": "fantasy", "friendly_name": "Fantasy"}}, {"model": "products.category", "pk": 8, "fields": {"name": "thriller", "friendly_name": "Thriller"}}, {"model": "products.category", "pk": 9, "fields": {"name": "history", "friendly_name": "History"}}, {"model": "products.category", "pk": 10, "fields": {"name": "irish_fiction", "friendly_name": "Irish Fiction"}}, {"model": "products.category", "pk": 11, "fields": {"name": "irish_nonfiction", "friendly_name": "Irish Nonfiction"}}, {"model": "products.category", "pk": 12, "fields": {"name": "irish_truecrime", "friendly_name": "Irish True Crime"}}, {"model": "products.category", "pk": 13, "fields": {"name": "irish_cookery", "friendly_name": "Irish Cookery"}}, {"model": "products.category", "pk": 14, "fields": {"name": "new_arrivals", "friendly_name": "New Arrivals"}}, {"model": "products.category", "pk": 15, "fields": {"name": "deals", "friendly_name": "deals"}}, {"model": "products.product", "pk": 1, "fields": {"category": 1, "sku": "pp5001340155", "name": "The Winemaker's Wife", "author": "Kristin Harmel", "description": "The author of the engrossing international bestseller The Room on Rue Amelie returns with a moving story set amid the champagne vineyards of northern France during the darkest days of World War II, perfect for fans of Kristin Hannah's The Nightingale. Champagne, 1940: Ines has just married Michel, the owner of storied champagne house Maison Chauveau, when the Germans invade. As the danger mounts, Michel turns his back on his marriage to begin hiding munitions for the Resistance. Ines fears they'll be exposed, but for Celine, half-Jewish wife of Chauveau's chef de cave, the risk is even greater rumours abound of Jews being shipped east to an unspeakable fate. When Celine recklessly follows her heart in one desperate bid for happiness, and Ines makes a dangerous mistake with a Nazi collaborator, they risk the lives of those they love and the champagne house that ties them together. New York, 2019: Liv Kent has just lost everything when her eccentric French grandmother shows up unannounced, insisting on a trip to France. But the older woman has an ulterior motive and a tragic, decades-old story to share. When past and present finally collide, Liv finds herself on a road to salvation that leads right to the caves of the Maison Chauveau.", "price": "12.60", "rating": "4.17", "image_url": null, "image": "The Winemaker's Wife.jpg"}}, {"model": "products.product", "pk": 2, "fields": {"category": 1, "sku": "pp5001600425", "name": "The Spanish Love Deception", "author": "Elena Armas", "description": "A wedding in Spain. The most infuriating man. Three days to convince your family you're actually in love.Catalina Martin desperately needs a date for her sister's wedding. Especially when her little white lie about her American boyfriend has spiralled out of control. Now everyone she knows - including her ex-boyfriend and his fiancee - will be there.  She only has four weeks to find someone willing to cross the Atlantic for her and aid in her deception. NYC to Spain is no short flight and her family won't be easy to fool. . . But even then, when Aaron Blackford - the 6'4, blue-eyed pain in the arse - offers to step in, she's not tempted even for a second. Never has there been a more aggravating, blood-boiling and insufferable man.  But Catalina is  desperate and as the wedding gets closer the more desirable an option Aaron Blackford becomes. . . The Spanish Love Deception  is an enemies-to-lovers, fake-dating romance. Perfect for those looking for a steamy slow-burn with the promise of a sweet happy-ever-after. 'Everything you could want in a romance is right here.'  Helen Hoang, author of The Kiss Quotient", "price": "12.60", "rating": "4.09", "image_url": null, "image": "The Spanish Love Deception.jpg"}}, {"model": "products.product", "pk": 3, "fields": {"category": 1, "sku": "pp5001730010", "name": "Baby It's Cold Outside", "author": "Emily Bell", "description": "As Norah battles alone, yet again, through the bustling December crowds outside Fortnum & Mason, she hears the first notes of a busker's song that transports her back to the most romantic week of her life. Laughing under an Italian sky, knowing they had to part, Andrew made her a promise: If they are both single on Christmas Eve in ten years' time, they will meet under the clock on Grafton Street, Dublin. Norah has no idea if Andrew will remember, but she has nothing to lose. So that's where she decides to go. To Dublin. To that clock. Hoping for a Christmas miracle with Andrew. But it wouldn't be Christmas without a few surprises . . . ", "price": "11.20", "rating": "3.79", "image_url": null, "image": "Baby It's Cold Outside.jpg"}}, {"model": "products.product", "pk": 4, "fields": {"category": 1, "sku": "pp5001890157", "name": "The Unexpected Love Story of Lexie Byrne", "author": "Caroline Grace-Cassidy", "description": "An irresistible love story . . . delivered with sparkle and wit (in a too-tight red dress!) Meet Lexie Byrne. The big 4-0 is looming, but she's perfectly content without a man. How else could she watch movies on repeat and eat crisp sandwiches in bed? Finally free of her love-rat ex, she's never settling again. Nothing less than 'The One' will do. Then, after an electrifying encounter on a wild St Patrick's Day, Lexie takes a leap of faith and a flight across the Irish Sea. But as sparks fly, Lexie's dreams take a serious nosedive. Until an arrival no one anticipated . . . Will the unexpected love story of Lexie Byrne have a happy ending after all?", "price": "18.20", "rating": "3.68", "image_url": "https://www.easons.com/globalassets/book-covers/2021-06/the-unexpected-love-story-of.jpg", "image": "4137EY-rdGL_hSbDvyT.jpg"}}, {"model": "products.product", "pk": 5, "fields": {"category": 1, "sku": "pp5002111605", "name": "Ghosts", "author": "Dolly Alderton", "description": "Nina Dean has arrived in her early thirties as a successful food writer with loving friends and family, plus a new home and neighbourhood. When she meets Max, a beguiling romantic hero who tells her on date one that he's going to marry her, it feels like all is going to plan. A new relationship couldn't have come at a better time - her thirties have not been the liberating, uncomplicated experience she was sold. Everywhere she turns, she is reminded of time passing and opportunities dwindling. Friendships are fading, ex-boyfriends are moving on and, worse, everyone's moving to the suburbs. There's no solace to be found in her family, with a mum who's caught in a baffling midlife makeover and a beloved dad who is vanishing in slow-motion into dementia. Dolly Alderton's debut novel is funny and tender, filled with whip-smart observations about relationships, family, memory, and how we live now.", "price": "12.60", "rating": "3.94", "image_url": "https://www.easons.com/globalassets/5637150827/all/books/fiction/mills-and-boon/romance/97802419886882.jpg", "image": "71a4SB9YecL_TrRSvDM.jpg"}}, {"model": "products.product", "pk": 6, "fields": {"category": 1, "sku": "pp5002260206", "name": "You and Me on Vacation", "author": " Emily Henry", "description": "TWO FRIENDS. TEN SUMMER TRIPS. THEIR LAST CHANCE TO FALL IN LOVE. 12 SUMMERS AGO: Poppy and Alex meet. They hate each other, and are pretty confident they'll never speak again. 11 SUMMERS AGO: They're forced to share a ride home from college and by the end of it a friendship is formed. And a pact: every year, one vacation together. 10 SUMMERS AGO: Alex discovers his fear of flying on the way to Vancouver. Poppy holds his hand the whole way. 7 SUMMERS AGO: They get far too drunk and narrowly avoid getting matching tattoos in New Orleans. 2 SUMMERS AGO: It all goes wrong. THIS SUMMER: Poppy asks Alex to join her on one last trip. A trip that will determine the rest of their lives. You and Me on Vacation is a love story for fans of When Harry Met Sally and One Day. Get ready to travel the world, snort with laughter and - most of all - lose your heart to Poppy and Alex.", "price": "12.60", "rating": "4.02", "image_url": "https://www.easons.com/globalassets/5637150827/all/books/fiction/mills-and-boon/romance/9780241992234.jpg", "image": "9780241992234.jpg"}}, {"model": "products.product", "pk": 7, "fields": {"category": 1, "sku": "pp5002440521", "name": "Grown Ups", "author": "Marian Keyes", "description": "They're a glamorous family, the Caseys. Johnny Casey, his two brothers Ed and Liam, their beautiful, talented wives and all their kids spend a lot of time together - birthday parties, anniversary celebrations, weekends away. And they're a happy family. Johnny's wife, Jessie - who has the most money - insists on it. Under the surface, though, conditions are murkier. While some people clash, other people like each other far too much . . . Everything stays under control until Ed's wife Cara, gets a concussion and can't keep her thoughts to herself. One careless remark at Johnny's birthday party, with the entire family present, starts Cara spilling out all their secrets. In the subsequent unravelling, every one of the adults finds themselves wondering if it's time - finally - to grow up?", "price": "12.60", "rating": "3.96", "image_url": "https://www.easons.com/globalassets/5637150827/all/books/fiction/mills-and-boon/romance/9781405918787.jpg", "image": "9781405918787.jpg"}}, {"model": "products.product", "pk": 8, "fields": {"category": 1, "sku": "pp5002601115", "name": "A Court of Mist and Fury", "author": "Sarah J. Maas", "description": "Feyre survived Amarantha's clutches to return to the Spring Court but at a steep cost. Though she now has the powers of the High Fae, her heart remains human, and it can't forget the terrible deeds she performed to save Tamlin's people. Nor has Feyre forgotten her bargain with Rhysand, High Lord of the feared Night Court. As Feyre navigates its dark web of politics, passion, and dazzling power, a greater evil looms and she might be key to stopping it. But only if she can harness her harrowing gifts, heal her fractured soul, and decide how she wishes to shape her future and the future of a world cleaved in two. With more than a million copies sold of her beloved Throne of Glass series, Sarah J. Maas's masterful storytelling brings this second book in her seductive and action-packed series to new heights.", "price": "12.60", "rating": "4.61", "image_url": "https://www.easons.com/globalassets/5637150827/all/books/fiction/science-fantasy/fantasy/9781526617163.jpg", "image": "9781526617163_1_8_vE4Xtm1.jpg"}}, {"model": "products.product", "pk": 9, "fields": {"category": 1, "sku": "pp5002690715", "name": "The Storm Sister", "author": "Lucinda Riley", "description": "Ally D'Apliese is about to compete in one of the world's most perilous yacht races, when she hears the news of her adoptive father's sudden, mysterious death. Rushing back to meet her five sisters at their family home, she discovers that her father - an elusive billionaire affectionately known to his daughters as Pa Salt - has left each of them a tantalising clue to their true heritage. Ally has also recently embarked on a deeply passionate love affair that will change her destiny forever. But with her life now turned upside down, Ally decides to leave the open seas and follow the trail that her father left her, which leads her to the icy beauty of Norway...There, Ally begins to discover her roots and how her story is inextricably bound to that of a young unknown singer, Anna Landvik, who lived there over 100 years before, and sang in the first performance of Grieg's iconic music set to Ibsen's play 'Peer Gynt'. As Ally learns more about Anna, she also begins to question who her father, Pa Salt, really was. And why is the seventh sister missing? Following the bestselling The Seven Sisters, The Storm Sister is the second book in Lucinda Riley's spellbinding series based loosely on the mythology surrounding the famous star constellation.", "price": "12.60", "rating": "4.25", "image_url": "https://www.easons.com/globalassets/5637150827/all/books/fiction/mills-and-boon/romance/9781529003468.jpg", "image": "9781529003468.jpg"}}, {"model": "products.product", "pk": 10, "fields": {"category": 2, "sku": "pp5002701115", "name": "The Night Shift", "author": "Alex Finlay", "description": "It's New Year's Eve 1999. Y2K is expected to end in chaos: planes falling from the sky, elevators plunging to earth, world markets collapsing. A digital apocalypse. None of that happens. But at a Blockbuster Video in Linden, New Jersey, four teenage girls working the night shift are attacked. Only one survives. Police quickly identify a suspect who flees and is never seen again. Fifteen years later, in the same town, four teenage employees working late at an ice cream store are attacked, and again only one makes it out alive. Both surviving victims recall the killer speaking only a few final words... 'Goodnight, pretty girl.' In the aftermath, three lives intersect: the survivor of the Blockbuster massacre who's forced to relive her tragedy; the brother of the original suspect, who's convinced the police have it wrong; and the FBI agent, who's determined to solve both cases. On a collision course toward the truth, all three lives will forever be changed, and not everyone will make it out alive. Twisty, poignant, and redemptive, The Night Shift is a story about the legacy of trauma and how the broken can come out on the other side, and it solidifies Alex Finlay as one of the new leading voices in the world of thrillers.", "price": "12.99", "rating": "4.06", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81W35+Tj7dL.jpg", "image": "81W35+Tj7dL.jpg"}}, {"model": "products.product", "pk": 11, "fields": {"category": 2, "sku": "pp5002761055", "name": "The Cartographers", "author": "Peng Shepherd ", "description": "Nell Young's whole life and greatest passion is cartography. Her father, Dr. Daniel Young, is a legend in the field and Nell's personal hero. But she hasn't seen or spoken to him ever since he cruelly fired her and destroyed her reputation after an argument over an old, cheap gas station highway map. But when Dr. Young is found dead in his office at the New York Public Library, with the very same seemingly worthless map hidden in his desk, Nell can't resist investigating. To her surprise, she soon discovers that the map is incredibly valuable and exceedingly rare. In fact, she may now have the only copy left in existence... because a mysterious collector has been hunting down and destroying every last onenalong with anyone who gets in the way. But why? To answer that question, Nell embarks on a dangerous journey to reveal a dark family secret and discovers the true power that lies in maps... From the critically acclaimed author of The Book of M, a highly imaginative thriller about a young woman who discovers that a strange map in her deceased father's belongings holds an incredible, deadly secret one that will lead her on an extraordinary adventure and to the truth about her family's dark history.", "price": "19.99", "rating": "3.80", "image_url": null, "image": "The Cartographers.jpg"}}, {"model": "products.product", "pk": 12, "fields": {"category": 2, "sku": "pp5002820069", "name": "Nine Lives", "author": "Peter Swanson", "description": "Nine strangers receive a list with their names on it in the mail. Nothing else, just a list of names on a single sheet of paper. None of the nine people know or have ever met the others on the list. They dismiss it as junk mail, a fluke until very, very bad things begin happening to people on the list. First, a well-liked old man drowned on a beach in the small town of Kennewick, Maine. Then, a father is shot in the back while running through his quiet neighbourhood in suburban Massachusetts. A frightening pattern is emerging, but what do these nine people have in common? Their professions range from oncology nurse to aspiring actor. FBI agent Jessica Winslow, who is on the list herself, is determined to find out. Could there be some dark secret that binds them all together? Or is this the work of a murderous madman? As the mysterious sender stalks these nine strangers, they find themselves constantly looking over their shoulders, wondering who will be crossed off next...", "price": "12.99", "rating": "3.65", "image_url": "https://images-na.ssl-images-amazon.com/images/I/918H8+3vrML.jpg", "image": "918H8+3vrML.jpg"}}, {"model": "products.product", "pk": 13, "fields": {"category": 2, "sku": "pp5002820147", "name": "A Forgery of Roses", "author": "Jessica S. Olson", "description": "Myra Whitlock has a gift. One many would kill for. She's an artist whose portraits alter people's real-life bodies, a talent she must hide from those who would kidnap, blackmail, and worse in order to control it. Guarding that secret is the only way to keep her younger sister safe now that their parents are gone. But one frigid night, the governor's wife discovers the truth and threatens to expose Myra if she does not complete a special portrait that would resurrect the governor's dead son. Desperate, Myra ventures to his legendary stone mansion. Once she arrives, however, it becomes clear the boy's death was no accident. Someone dangerous lurks within these glittering halls. Someone harboring a disturbing obsession with portrait magic. Myra cannot do the painting until she knows what really happened, so she turns to the governor's older son, a captivating redheaded poet. Together, they delve into the family's most shadowed affairs, racing to uncover the truth before the secret Myra spent her life concealing makes her the killer's next victim. From Sing Me Forgotten author Jessica S. Olson comes a gothic fantasy murder mystery perfect for fans of Kerri Maniscalco and Erin A. Craig.", "price": "12.99", "rating": "3.92", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1624639782l/51941042.jpg", "image": "1624639782l/51941042.jpg"}}, {"model": "products.product", "pk": 14, "fields": {"category": 2, "sku": "pp5002910572", "name": "The Resting Place", "author": "Camilla Sten", "description": "A spine-chilling, propulsive psychological suspense from international sensation Camilla Sten. The medical term is prosopagnosia. The average person calls it face blindness the inability to recognize a familiar person's face, even the faces of those closest to you. When Eleanor walked in on the scene of her capriciously cruel grandmother, Vivianne's, murder, she came face to face with the killer a maddening expression that means nothing to someone like her. With each passing day, her anxiety mounts. The dark feelings of having been brushed by a killer, yet not knowing who could do this or if they'd be back overtakes both her dreams and her waking moments, thwarting her perception of reality. Then a lawyer calls. Vivianne has left her a house a looming estate tucked away in the Swedish woods. The place where her grandfather died, suddenly. A place that has housed a dark past for over fifty years. Eleanor. Her steadfast boyfriend, Sebastian. Her reckless aunt, Veronika. The lawyer. All will go to this house of secrets, looking for answers. But as they get closer to bringing the truth to light, they'll wish they had never come to disturb what rests there. A heart-thumping, relentless thriller that will shake you to your core, The Resting Place is an unforgettable novel of horror and suspense.", "price": "14.99", "rating": "3.72", "image_url": "https://m.media-amazon.com/images/I/41eH70d+D-L.jpg", "image": "41eH70d+D-L.jpg"}}, {"model": "products.product", "pk": 15, "fields": {"category": 2, "sku": "pp5002990740", "name": "The Love of My Life", "author": "Rosie Walsh", "description": "From the New York Times bestselling author of Ghosted comes a love story wrapped in a mystery: an up-all-night page-turner with a dark secret at its core I have held you at night for ten years and I didn't even know your name. We have a child together. A dog, a house. Who are you? Emma loves her husband Leo and their young daughter Ruby: she'd do anything for them. But almost everything she's told them about herself is a lie. And she might just have got away with it, if it weren't for her husband's job. Leo is an obituary writer; Emma a well-known marine biologist. When she suffers a serious illness, Leo copes by doing what he knows best researching and writing about his wife's life. But as he starts to unravel the truth, he discovers the woman he loves doesn't really exist. Even her name isn't real. When the very darkest moments of Emma's past finally emerge, she must somehow prove to Leo that she really is the woman he always thought she was . . . But first, she must tell him about the other love of her life. ", "price": "14.99", "rating": "4.03", "image_url": "https://kbimages1-a.akamaihd.net/64fa5de5-414f-4a48-9b42-19380d7d70ad/1200/1200/False/the-love-of-my-life-11.jpg", "image": "the-love-of-my-life-11.jpg"}}, {"model": "products.product", "pk": 16, "fields": {"category": 2, "sku": "pp5003050248", "name": "The Bone Orchard", "author": "Sara A. Mueller", "description": "Charm is a witch, and she is alone. The last of a line of conquered necromantic workers, now confined within the yard of regrown bone trees at Orchard House, and the secrets of their marrow. Charm is a prisoner, and a survivor. Charm tends the trees and their clattering fruit for the sake of her children, painstakingly grown and regrown with its fruit: Shame, Justice, Desire, Pride, and Pain. Charm is a whore, and a madam. The wealthy and powerful of Borenguard come to her house to buy time with the girls who aren't real. Except on Tuesdays, which is when the Emperor himself lays claim to his mistress, Charm herself. now Charm is also the only person who can keep an empire together, as the Emperor summons her to his deathbed, and charges her with choosing which of his awful, faithless sons will carry on the empire by discovering which one is responsible for his own murder. If she does this last thing, she will finally have what has been denied her since the fall of Inshil her freedom. But she will also be betraying the ghosts past and present that live on within her heart. Charm must choose. Her dead Emperor's will or the whispers of her own ghosts. Justice for the empire or her own revenge.", "price": "15.99", "rating": "3.76", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81vZaw-ZydL.jpg", "image": "81vZaw-ZydL.jpg"}}, {"model": "products.product", "pk": 17, "fields": {"category": 2, "sku": "pp5003070787", "name": "Girl in Ice", "author": "Erica Ferencik ", "description": "From the author of The River at Night and Into the Jungle comes a harrowing new thriller set in the unforgiving landscape of the Arctic Circle, as a brilliant linguist struggling to understand the apparent suicide of her twin brother ventures hundreds of miles north to try to communicate with a young girl who has thawed from the ice alive. Valerie 'Val' Chesterfield is a linguist trained in the most esoteric of disciplines: dead Nordic languages. Despite her successful career, she leads a sheltered life and languishes in the shadow of her twin brother Andy, an accomplished climate scientist stationed on a remote island off Greenland's barren coast. But Andy is gone: a victim of suicide, having willfully ventured unprotected into 50 degree below zero weather. Val is inconsolable and disbelieving. She suspects foul play. When Wyatt, Andy's fellow researcher in the Arctic, discovers a scientific impossibility­ a young girl frozen in the ice who thaws out alive, speaking a language no one understands Val is his first call. Will she travel to the frozen North and meet this girl, try to comprehend what she is so passionately trying to communicate? Under the auspices of helping Wyatt interpret the girl's speech, Val musters every ounce of her courage and journeys to the Arctic to solve the mystery of her brother's death. The moment she steps off the plane, her fear threatens to overwhelm her. The landscape is fierce, and Wyatt, brilliant but difficult, is an enigma. But the girl is special, and Val's connection with her is profound. Only something is terribly wrong; the child is sick, maybe dying, and the key to saving her lies in discovering the truth about Wyatt's research. Can his data be trusted? And does it have anything to do with how and why Val's brother died? With time running out, Val embarks on an incredible frozen odyssey led by the unlikeliest of guides to rescue the new family she has found in the most unexpected of places.", "price": "12.99", "rating": "3.83", "image_url": "https://m.media-amazon.com/images/I/61x5463riML.jpg", "image": "61x5463riML.jpg"}}, {"model": "products.product", "pk": 18, "fields": {"category": 2, "sku": "pp5003090182", "name": "The Long Weekend", "author": "Gilly Macmillan", "description": "Three couples. Two bodies. One secret. Dark Fell Barn is a 'perfectly isolated' retreat, or so says its website when Jayne books a reservation for her friends. A quiet place, far removed from the rest of the world, is exactly what they need. The women arrive for a girls' night ahead of their husbands. There's ex-Army Jayne, hardened and serious, but also damaged. Ruth, the driven doctor and new mother who is battling demons of her own. Young Emily, just wed and insecure, the newest addition of this tight-knit band. Missing this year is Edie, who was the glue holding them together until her husband died suddenly. But what they hoped would be a relaxing break soon turns to horror. Upon arrival at Dark Fell Barn, the women find a devastating note claiming one of their husbands will be murdered. There are no phones, no cell service to check on their men. Friendships fracture as the situation spins wildly out of control. Betrayal can come in many forms. This group has kept each other's secrets for far too long.", "price": "14.99", "rating": "3.62", "image_url": "https://images-na.ssl-images-amazon.com/images/I/816bOKCJWkL.jpg", "image": "816bOKCJWkL.jpg"}}, {"model": "products.product", "pk": 19, "fields": {"category": 2, "sku": "pp5003090186", "name": "The Interview", "author": "C.M. Ewan", "description": "The Interview is a gripping thriller from C. M. Ewan, the acclaimed author of A Window Breaks and the half-a-million-copy bestseller Safe House. It's 5 p.m. on a Friday. You have been called to an interview for your dream job. In a stunning office thirteen floors above the city below, you are all alone with the man interviewing you. Everyone else has gone home for the weekend. The interview gets more and more disturbing. You're feeling scared. Your only way out is to answer a seemingly impossible question. If you can't . . . what happens next?", "price": "12.99", "rating": "3.74", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1636282560l/59559565._SY475_.jpg", "image": "59559565._SY475_.jpg"}}, {"model": "products.product", "pk": 20, "fields": {"category": 3, "sku": "pp5003161326", "name": "Again, Rachel", "author": "Marian Keyes", "description": "In her twenties, Rachel Walsh was a mess. Since her spell in rehab, though, she's come a long way on the road to recovery - and now, she's ready to go back to where it all began. But this time, the student has become the teacher. She used to hate the staff in charge of treating her addiction. Now, she's one of them. Rachel's finally got herself on track - but life never stops being messy. And when an old flame resurfaces, will she go back to who she once was? Or nearing fifty, can she find herself all over again?", "price": "12.99", "rating": "4.52", "image_url": "https://m.media-amazon.com/images/I/71be8HNSHYL.jpg", "image": "71be8HNSHYL.jpg"}}, {"model": "products.product", "pk": 21, "fields": {"category": 3, "sku": "pp5003230723", "name": "Lessons in Chemistry", "author": "Bonnie Garmus", "description": "A delight for readers of Where'd You Go, Bernadette and The Marvellous Mrs. Maisel, this blockbuster debut set in 1960s California features the singular voice of Elizabeth Zott, a scientist whose career takes a detour when she becomes the star of a beloved TV cooking show. Chemist Elizabeth Zott is not your average woman. In fact, Elizabeth Zott would be the first to point out that there is no such thing as an average woman. But it's the early 1960s and her all-male team at Hastings Research Institute takes a very unscientific view of equality. Except for one: Calvin Evans; the lonely, brilliant, Nobel-prize nominated grudge-holder who falls in love with--of all things--her mind. True chemistry results. But like science, life is unpredictable. Which is why a few years later Elizabeth Zott finds herself not only a single mother, but the reluctant star of America's most beloved cooking show Supper at Six. Elizabeth's unusual approach to cooking ('combine one tablespoon acetic acid with a pinch of sodium chloride') proves revolutionary. But as her following grows, not everyone is happy. Because as it turns out, Elizabeth Zott isn't just teaching women to cook. She's daring them to change the status quo. Laugh-out-loud funny, shrewdly observant, and studded with a dazzling cast of supporting characters, Lessons in Chemistry is as original and vibrant as its protagonist.", "price": "18.20", "rating": "4.52", "image_url": "https://images.penguinrandomhouse.com/cover/9780385547345", "image": "9780385547345.jpg"}}, {"model": "products.product", "pk": 22, "fields": {"category": 3, "sku": "pp5003270936", "name": "None of This is Serious", "author": "Catherine Prasifka", "description": "'Extraordinary' Naoise Dolan 'Seriously good' Louise Nealon Dublin student life is ending for Sophie and her friends. They've got everything figured out, and Sophie feels left behind as they all start to go their separate ways. She's overshadowed by her best friend Grace. She's been in love with Finn for as long as she's known him. And she's about to meet Rory, who's suddenly available to her online. At a party, what was already unstable completely falls apart and Sophie finds herself obsessively scrolling social media, waiting for something (anything) to happen. None of This Is Serious is about the uncertainty and absurdity of being alive today. It's about balancing the real world with the online, and the vulnerabilities in yourself, your relationships, your body. At its heart, this is a novel about friendships strong enough to withstand anything.", "price": "18.20", "rating": "3.58", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1632760172l/59085460._SY475_.jpg", "image": "59085460._SY475_.jpg"}}, {"model": "products.product", "pk": 23, "fields": {"category": 3, "sku": "pp5003360384", "name": "Rachel's Holiday", "author": "Marian Keyes", "description": "Meet Rachel Walsh. She has a pair of size 8 feet and such a fondness for recreational drugs that her family has forked out the cash for a spell in Cloisters Dublin's answer to the Betty Ford Clinic. She's only agreed to her incarceration because she's heard that rehab is wall-to-wall jacuzzis, gymnasiums and rock stars going tepid turkey and it's about time she had a holiday. But what Rachel doesn't count on are the toe-curling embarrassments heaped on her by family and group therapy, the dearth of sex, drugs and rock'n'roll and missing Luke, her ex. What kind of a new start in life is this?", "price": "12.60", "rating": "3.98", "image_url": "https://images-na.ssl-images-amazon.com/images/I/41THlZ3l7DL.jpg", "image": "41THlZ3l7DL.jpg"}}, {"model": "products.product", "pk": 24, "fields": {"category": 3, "sku": "pp5003440111", "name": "Royal Velvet Down Chamber Pillow", "author": "Taylor Jenkins Reid", "description": "Ageing and reclusive Hollywood movie icon Evelyn Hugo is finally ready to tell the truth about her glamorous and scandalous life. But when she chooses unknown magazine reporter Monique Grant for the job, no one is more astounded than Monique herself. Why her? Why now? Monique is not exactly on top of the world. Her husband has left her, and her professional life is going nowhere. Regardless of why Evelyn has selected her to write her biography, Monique is determined to use this opportunity to jump start her career. Summoned to Evelyn's luxurious apartment, Monique listens in fascination as the actress tells her story. From making her way to Los Angeles in the 1950s to her decision to leave show business in the '80s, and, of course, the seven husbands along the way, Evelyn unspools a tale of ruthless ambition, unexpected friendship, and a great forbidden love. Monique begins to feel a very real connection to the legendary star, but as Evelyn's story near its conclusion, it becomes clear that her life intersects with Monique's own in tragic and irreversible ways.", "price": "12.60", "rating": "4.48", "image_url": "https://m.media-amazon.com/images/I/51kVpauOUAL.jpg", "image": "51kVpauOUAL.jpg"}}, {"model": "products.product", "pk": 25, "fields": {"category": 3, "sku": "pp5003540313", "name": "The Diamond Eye", "author": "Kate Quinn", "description": "In 1937 in the snowbound city of Kiev (now known as Kyiv), wry and bookish history student Mila Pavlichenko organizes her life around her library job and her young son--but Hitler's invasion of Ukraine and Russia sends her on a different path. Given a rifle and sent to join the fight, Mila must forge herself from studious girl to deadly sniper--a lethal hunter of Nazis known as Lady Death. When news of her three hundredth kill makes her a national heroine, Mila finds herself torn from the bloody battlefields of the eastern front and sent to America on a goodwill tour. Still reeling from war wounds and devastated by loss, Mila finds herself isolated and lonely in the glittering world of Washington, DC--until an unexpected friendship with First Lady Eleanor Roosevelt and an even more unexpected connection with a silent fellow sniper offer the possibility of happiness. But when an old enemy from Mila's past joins forces with a deadly new foe lurking in the shadows, Lady Death finds herself battling her own demons and enemy bullets in the deadliest duel of her life. Based on a true story, The Diamond Eye is a haunting novel of heroism born of desperation, of a mother who became a soldier, of a woman who found her place in the world and changed the course of history forever.", "price": "16.99", "rating": "4.00", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1641777418l/58490567.jpg", "image": "58490567.jpg"}}, {"model": "products.product", "pk": 26, "fields": {"category": 3, "sku": "pp5003560513", "name": "The Paris Apartment", "author": "Lucy Foley", "description": "From the New York Times bestselling author of The Guest List comes a new locked room mystery, set in a Paris apartment building in which every resident has something to hide. Jess needs a fresh start. She's broke and alone, and she's just left her job under less than ideal circumstances. Her half-brother Ben didn't sound thrilled when she asked if she could crash with him for a bit, but he didn't say no, and surely everything will look better from Paris. Only when she shows up to find a very nice apartment, could Ben really have afforded this? he's not there. The longer Ben stays missing, the more Jess starts to dig into her brother's situation, and the more questions she has. Ben's neighbours are an eclectic bunch, and not particularly friendly. Jess may have come to Paris to escape her past, but it's starting to look like it's Ben's future that's in question. The socialite The nice guy The alcoholic The girl on the verge The concierge Everyone's a neighbour. Everyone's a suspect. And everyone knows something they're not telling.", "price": "18.20", "rating": "3.72", "image_url": "https://images-na.ssl-images-amazon.com/images/I/8168WpLC11L.jpg", "image": "8168WpLC11L.jpg"}}, {"model": "products.product", "pk": 27, "fields": {"category": 3, "sku": "pp5003560948", "name": "It Ends with Us", "author": "Colleen Hoover", "description": "Sometimes it is the one who loves you who hurts you the most. Lily hasn't always had it easy, but that's never stopped her from working hard for the life she wants. She's come a long way from the small town in Maine where she grew up she graduated from college, moved to Boston, and started her own business. So when she feels a spark with a gorgeous neurosurgeon named Ryle Kincaid, everything in Lily's life suddenly seems almost too good to be true. Ryle is assertive, stubborn, maybe even a little arrogant. He's also sensitive, brilliant, and has a total soft spot for Lily. And the way he looks in scrubs certainly doesn't hurt. Lily can't get him out of her head. But Ryle's complete aversion to relationships is disturbing. Even as Lily finds herself becoming the exception to his 'no dating' rule, she can't help but wonder what made him that way in the first place.", "price": "12.60", "rating": "4.43", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81PdOsc95OL.jpg", "image": "81PdOsc95OL.jpg"}}, {"model": "products.product", "pk": 28, "fields": {"category": 3, "sku": "pp5003570628", "name": "Ugly Love", "author": "Colleen Hoover", "description": "When Tate Collins meets airline pilot Miles Archer, she knows it isn't love at first sight. They wouldn't even go so far as to consider themselves friends. The only thing Tate and Miles have in common is an undeniable mutual attraction. Once their desires are out in the open, they realise they have the perfect set-up. He doesn't want love, she doesn't have time for love, so that just leaves the sex. Their arrangement could be surprisingly seamless, as long as Tate can stick to the only two rules Miles has for her. Never ask about the past. Don't expect a future. They think they can handle it, but realise almost immediately they can't handle it at all. Hearts get infiltrated. Promises get broken. Rules get shattered. Love gets ugly.", "price": "12.60", "rating": "4.26", "image_url": "https://images-na.ssl-images-amazon.com/images/I/613KCs7szvL.jpg", "image": "613KCs7szvL.jpg"}}, {"model": "products.product", "pk": 29, "fields": {"category": 3, "sku": "pp5003620308", "name": "Where the Crawdads Sing", "author": "Delia Owens", "description": "For years, rumours of the 'Marsh Girl' haunted Barkley Cove, a quiet fishing village. Kya Clark is barefoot and wild; unfit for polite society. So in late 1969, when the popular Chase Andrews was found dead, locals immediately suspected her. But Kya is not what they say. A born naturalist with just one day of school, she takes life's lessons from the land, learning the real ways of the world from the dishonest signals of fireflies. But while she has the skills to live in solitude forever, the time comes when she yearns to be touched and loved. Drawn to two young men from town, who are each intrigued by her wild beauty, Kya opens herself to a new and startling world until the unthinkable happens. In Where the Crawdads Sing, Owens juxtaposes an exquisite ode to the natural world against a profound coming of age story and haunting mystery. Thought-provoking, wise, and deeply moving, Owens's debut novel reminds us that we are forever shaped by the child within us, while also subject to the beautiful and violent secrets that nature keeps. The story asks how isolation influences the behaviour of a young woman, who like all of us, has the genetic propensity to belong to a group. The clues to the mystery are brushed into the lush habitat and natural histories of its wild creatures.", "price": "12.99", "rating": "4.46", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81HA6TJ5K-L.jpg", "image": "81HA6TJ5K-L.jpg"}}, {"model": "products.product", "pk": 30, "fields": {"category": 4, "sku": "pp5003690115", "name": "Journey's End: The Truth about Life after Death", "author": "Colm Keane", "description": "Journey's End reveals how death is not an end but a new beginning. This groundbreaking book explains how our consciousness survives physical death and lives on in a hereafter of our own making.What life will be like in this otherworld is outlined. The book also shows that we will meet again deceased relatives and beloved pets.Based on 13 years of research, Colm Keane discovers the truth about heaven, purgatory, hell, God, Satan and reincarnation. He debunks myths such as fiery punishments and the concept of a grotesque devil.Journey's End draws from the latest scientific evidence, hundreds of near-death experiences and writings from the great mystics and scholars. It is a must-read for everyone interested in what happens after death.Colm Keane has published 30 books, including eight No.1 bestsellers, and an overall total of 19 Top Six bestsellers.", "price": "14.99", "rating": "4.80", "image_url": "https://images-na.ssl-images-amazon.com/images/I/41%2BJi-NplNL._SX342_SY445_QL70_ML2_.jpg", "image": "41%2BJi-NplNL._SX342_SY445_QL70_ML2_.jpg"}}, {"model": "products.product", "pk": 31, "fields": {"category": 4, "sku": "pp5003690116", "name": "Let's Talk: About Relationships, Sex and Intimacy", "author": "Richie Sadlier", "description": "Let's Talk is a ground-breaking new book for teenage boys that talks about the stuff they really want to talk about, learn and understand. From being single to being a boyfriend, being gay, being straight, sex, relationships, dating, sexting, drinking and break-ups, this book covers it all. It discusses porn, pleasure and fun, condoms and safety and all the ways to understand consent. In a radical departure from previous generations' attitudes towards talking about difficult subjects, Let's Talk empowers teenagers to make wise decisions when they are having their first experiences, informing and preparing them to have positive encounters. Nobody gets everything right. There'll still be mistakes and awkward moments, but there's a far better chance of positive experiences if you've had the chance to talk, read and learn about these things in advance. So, let's talk!", "price": "19.99", "rating": "4.00", "image_url": "https://m.media-amazon.com/images/I/51BKPXkkihL.jpg", "image": "51BKPXkkihL.jpg"}}, {"model": "products.product", "pk": 32, "fields": {"category": 4, "sku": "pp5003780391", "name": "Manifest: 7 Steps to Living Your Best Life", "author": "Roxie Nafousi", "description": "Written by self-development coach and 'Queen of Manifesting' Roxie Nafousi, this book is the essential guide to anyone and everyone wanting to feel more empowered in their lives. In just seven simple steps you can understand the true art of manifestation and create the life you have always dreamed of. Whether you want to attract your soulmate, land the perfect job, buy the home you have always wanted, or simply find more inner-peace and confidence, Manifest will teach you exactly how to get there . . . 1. Be clear in your vision. 2. Remove fear and doubt. 3. Align your behaviour. 4. Overcome tests from the universe. 5. Embrace gratitude without caveats. 6. Turn envy into inspiration. 7. Trust in the universe. A meeting of science and wisdom, manifesting is a philosophy and a self-development practice to help you reach for your goals, cultivate self-love and live your best life. Unlock the magic for yourself and begin your journey to turning your dreams into reality.", "price": "15.99", "rating": "4.43", "image_url": "https://images-na.ssl-images-amazon.com/images/I/31R6sKenehL.jpg", "image": "31R6sKenehL.jpg"}}, {"model": "products.product", "pk": 33, "fields": {"category": 4, "sku": "pp5003790542", "name": "The Irish Difference: A Tumultuous History of Ireland's Breakup with Britain", "author": "Fergal Tobin", "description": "A fascinating and entertaining investigation into what makes Ireland so different from its neighbours, by a respected Irish historian. For hundreds of years, the islands and their constituent tribes that make up the British Isles have lived next door to each other in a manner that, over time, suggested some movement towards political union. It was an uneven, stop-start business and it worked better in some places than in others. Still, England, Wales and Scotland have hung together through thick and thin, despite internal divisions of language, religion, law, culture and disposition that might have broken up a less resilient polity. And, for a long time, it seemed that something similar might have been said about the smaller island to the west: Ireland. Ireland was always a more awkward fit in the London-centric mini-imperium but no one imagined that it might detach itself altogether, until the moment came for rupture, quite suddenly and dramatically, in the fall-out from World War I. So, what was it - is it - about Ireland that is so different? Different enough to sever historical ties of centuries with such sudden violence and unapologetic efficiency. Wherein lies the Irish difference, a difference sufficient to have caused a rupture of that nature? In a wide-ranging and witty narrative, historian Fergal Tobin traces the relationship between Ireland and her neighbours, taking in everything from sports and culture to religion and politics, and reveals what it is that makes the Irish so different.", "price": "23.80", "rating": "4.00", "image_url": "https://cdn.waterstones.com/bookjackets/large/9781/8389/9781838952617.jpg", "image": "9781838952617.jpg"}}, {"model": "products.product", "pk": 34, "fields": {"category": 4, "sku": "pp5003831225", "name": "Good Vibes, Good Life: How Self-Love Is the Key to Unlocking Your Greatness", "author": "Vex King", "description": "A beautifully designed book full of inspiring quotes and tried-and-tested wisdom on using positivity to create a life you love. How can you learn to truly love yourself? How can you transform negative emotions into positive ones? Is it possible to find lasting happiness? With this book, Vex will show you that when you change the way you think, feel, speak and act, you begin to change the world.", "price": "15.40", "rating": "4.09", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61TGDPQr+YL.jpg", "image": "61TGDPQr+YL.jpg"}}, {"model": "products.product", "pk": 35, "fields": {"category": 4, "sku": "pp5003861402", "name": "Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones", "author": "James Clear", "description": "No matter your goals, Atomic Habits offers a proven framework for improving--every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviours that lead to remarkable results. If you're having trouble changing your habits, the problem isn't you. The problem is your system. Bad habits repeat themselves again and again not because you don't want to change, but because you have the wrong system for change. You do not rise to the level of your goals. You fall to the level of your systems. Here, you'll get a proven system that can take you to new heights. Clear is known for his ability to distil complex topics into simple behaviours that can be easily applied to daily life and work. Here, he draws on the most proven ideas from biology, psychology, and neuroscience to create an easy-to-understand guide for making good habits inevitable and bad habits impossible. Along the way, readers will be inspired and entertained with true stories from Olympic gold medalists, award-winning artists, business leaders, life-saving physicians, and star comedians who have used the science of small habits to master their craft and vault to the top of their field. Learn how to: make time for new habits (even when life gets crazy); overcome a lack of motivation and willpower; design your environment to make success easier; get back on track when you fall off course; ...and much more. Atomic Habits will reshape the way you think about progress and success, and give you the tools and strategies you need to transform your habits--whether you are a team looking to win a championship, an organisation hoping to redefine an industry, or simply an individual who wishes to quit smoking, lose weight, reduce stress, or achieve any other goal.", "price": "13.80", "rating": "4.38", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81wgcld4wxL.jpg", "image": "81wgcld4wxL.jpg"}}, {"model": "products.product", "pk": 36, "fields": {"category": 4, "sku": "pp5003910638", "name": "The Boy, the Mole, the Fox and the Horse", "author": "Charlie Mackesy", "description": "Enter the world of Charlie's four unlikely friends, discover their story and their most important life lessons. The boy, the mole, the fox and the horse have been shared millions of times online - perhaps you've seen them? They've also been recreated by children in schools and hung on hospital walls. They sometimes even appear on lamp posts and on cafe and bookshop windows. Perhaps you saw the boy and mole on the Comic Relief T-shirt, Love Wins? Here, you will find them together in this book of Charlie's most-loved drawings, adventuring into the Wild and exploring the thoughts and feelings that unite us all.", "price": "23.80", "rating": "4.58", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81PdkxXJObL.jpg", "image": "81PdkxXJObL.jpg"}}, {"model": "products.product", "pk": 37, "fields": {"category": 4, "sku": "pp5003950574", "name": "The Secret to Love, Health, and Money: A Masterclass", "author": "Rhonda Byrne", "description": "This in-depth master class from the author of the groundbreaking bestseller The Secret illustrates how to apply the law of attraction to three of life's most important areas: relationships, health, and money. Discover how to achieve personal happiness, wellbeing, and success with this collection of lessons, advice, and case studies from the bestselling author of the Secret series Rhonda Byrne. In the first part, she further explores the power of positive thoughts and how we can use the creative process to attract and maintain new and healthier relationships. The second part offers in-depth lessons that will help you apply the law of attraction to your health and physical wellbeing, featuring inspiring anecdotes from those who have used The Secret to overcome health crises such as cancer, chronic pain, depression, and more. Finally, learn how to improve your relationship with money by discovering the power you have to bring money into your life. From job hunting to adopting a wealth mindset, Byrne provides all that you need to achieve prosperity and professional success. With these impactful and accessible processes, you will experience firsthand a powerful transformation across all aspects of your life for the better.", "price": "18.20", "rating": "4.15", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81Iet7um1QL.jpg", "image": "81Iet7um1QL.jpg"}}, {"model": "products.product", "pk": 38, "fields": {"category": 4, "sku": "pp5003950576", "name": "Your One Wild and Precious Life: An Inspiring Guide to Becoming Your Best Self At Any Age", "author": "Maureen Gaffney", "description": "WINNER OF THE AUDIENCE CHOICE IRISH BOOK AWARD 2021. Once you've got a few decades on the clock, life can seem sort of cross-roads. Once you're no longer thinking of yourself as 'young', you may be looking back, thinking 'How did I get here?' And also looking ahead, wondering: 'What do I do now?' This realisation that neither time nor choices are limitless is both daunting and exciting. This is the moment to take stock and figure out how to make the best of every precious moment of the rest of your life. And to develop the tools to be able to do so again and again. Your One Wild and Precious Life is an eye-opening account of this surprisingly liberating process. Using the latest ground-breaking research, leading psychologist Maureen Gaffney has written an inspiring and practical guide for getting to grips with time. Taking the key stages of our life - from infancy to old age - she explores what we learn at each stage. And, crucially, she explains how, no matter what has happened in the past, and what age you are, you can find a better route forward. Your One Wild and Precious Life is both profound and reassuring. It will transform your thinking, connect you with who you truly are and help you to reclaim control over your life. Crucially, it will empower you to face the future with optimism. It is a book to fundamentally alter your relationship with time and show you that every age can be your best age. 'A profound, important work; simultaneously wise, instructive and a love letter to humanity' IRISH TIMES 'Fascinating and engaging' SUNDAY TIMES 'A must-read' IRISH DAILY MAIL '[It] will transform your thinking' IRISH FARMERS JOURNAL", "price": "21.00", "rating": "3.67", "image_url": "https://kbimages1-a.akamaihd.net/d56d2217-8ccb-4bcb-ab37-3a9d90ce5aa4/353/569/90/False/your-one-wild-and-precious-life-4.jpg", "image": "your-one-wild-and-precious-life-4.jpg"}}, {"model": "products.product", "pk": 39, "fields": {"category": 4, "sku": "pp5003960062", "name": "Home Expressions Microfiber Twin XL Sheet Set", "author": "Professor Rose Anne Kenny", "description": "Did you know that we can lead longer and healthier lives by making simple changes right now? Professor Rose Anne Kenny has 35 years of experience at the forefront of ageing medicine. In Age Proof, she draws on her own pioneering research and the latest evidence to demystify why we age and shows us that 80% of our ageing biology is within our control: we can not only live longer lives but become happier and healthier deep into our later years. Effortlessly distilling scientific theory into practical advice that we can apply to our everyday lives, Professor Kenny examines the impact that food, genetics, friendships, purpose, sex, exercise and laughter have on how our cells age. This illuminating book will show you the steps you can take to stay younger for longer - and will prove that you really are just as young as you feel.", "price": "21.00", "rating": "3.79", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61w3zbkqweL.jpg", "image": "61w3zbkqweL.jpg"}}, {"model": "products.product", "pk": 40, "fields": {"category": 5, "sku": "pp5003960682", "name": "One of Us Is Lying", "author": "Karen M. McManus", "description": "Pay close attention and you might solve this. On Monday afternoon, five students at Bayview High walked into detention. Bronwyn, the brain, is Yale-bound and never breaks a rule. Addy, the beauty, is the picture-perfect homecoming princess. Nate, the criminal, is already on probation for dealing. Cooper, the athlete, is the all-star baseball pitcher. And Simon, the outcast, is the creator of Bayview High's notorious gossip app. Only, Simon never makes it out of that classroom. Before the end of detention Simon's dead. And according to investigators, his death wasn't an accident. On Monday, he died. But on Tuesday, he'd planned to post juicy reveals about all four of his high-profile classmates, which makes all four of them suspects in his murder. Or are they the perfect patsies for a killer who's still on the loose? Everyone has secrets, right? What really matters is how far you would go to protect them. ", "price": "8.99", "rating": "4.02", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91rcpJsm-HL.jpg", "image": "91rcpJsm-HL.jpg"}}, {"model": "products.product", "pk": 41, "fields": {"category": 5, "sku": "pp5003960775", "name": "A Good Girl's Guide to Murder", "author": "Holly Jackson", "description": "The case is closed. Five years ago, schoolgirl Andie Bell was murdered by Sal Singh. The police know he did it. Everyone in town knows he did it. But having grown up in the same small town that was consumed by the murder, Pippa Fitz-Amobi isn't so sure. When she chooses the case as the topic for her final year project, she starts to uncover secrets that someone in town desperately wants to stay hidden. And if the real killer is still out there, how far will they go to keep Pip from the truth? ", "price": "11.20", "rating": "4.37", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91r3afbnQsL.jpg", "image": "91r3afbnQsL.jpg"}}, {"model": "products.product", "pk": 42, "fields": {"category": 5, "sku": "pp5003990736", "name": "Harry Potter and the Sorcerer's Stone", "author": "J. K. Rowling", "description": "Harry Potter's life is miserable. His parents are dead and he's stuck with his heartless relatives, who force him to live in a tiny closet under the stairs. But his fortune changes when he receives a letter that tells him the truth about himself: he's a wizard. A mysterious visitor rescues him from his relatives and takes him to his new home, Hogwarts School of Witchcraft and Wizardry. After a lifetime of bottling up his magical powers, Harry finally feels like a normal kid. But even within the Wizarding community, he is special. He is the boy who lived: the only person to have ever survived a killing curse inflicted by the evil Lord Voldemort, who launched a brutal takeover of the Wizarding world, only to vanish after failing to kill Harry. Though Harry's first year at Hogwarts is the best of his life, not everything is perfect. There is a dangerous secret object hidden within the castle walls, and Harry believes it's his responsibility to prevent it from falling into evil hands. But doing so will bring him into contact with forces more terrifying than he ever could have imagined. Full of sympathetic characters, wildly imaginative situations, and countless exciting details, the first instalment in the series assembles an unforgettable magical world and sets the stage for many high-stakes adventures to come. ", "price": "11.20", "rating": "4.48", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81YOuOGFCJL.jpg", "image": "81YOuOGFCJL.jpg"}}, {"model": "products.product", "pk": 43, "fields": {"category": 5, "sku": "pp5003990746", "name": "The Weight of Water", "author": "Sarah Crossan", "description": "Armed with a suitcase and an old laundry bag filled with clothes, Kasienka and her mother head for England. Life is lonely for Kasienka. At home her mother's heart is breaking and at school friends are scarce. But when someone special swims into her life, Kasienka learns that there might be more than one way for her to stay afloat. The Weight of Water is a startlingly original piece of fiction. A brilliant coming of age story, it also tackles the alienation experienced by many young immigrants. Moving, unsentimental, and utterly page turning, we meet and share the experiences of a remarkable girl who shows us how quiet courage prevails.", "price": "11.20", "rating": "3.84", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91nwftv13xL.jpg", "image": "91nwftv13xL.jpg"}}, {"model": "products.product", "pk": 44, "fields": {"category": 5, "sku": "pp5004111503", "name": "Good girl, bad blood", "author": "Holly Jackson", "description": "Pip is not a detective anymore. With the help of Ravi Singh, she released a true crime podcast about the murder case they solved together last year. The podcast has gone viral, yet Pip insists her investigating days are behind her. But she will have to break that promise when someone she knows goes missing. Jamie Reynolds has disappeared, on the very same night the town hosted a memorial for the sixth year anniversary of the deaths of Andie Bell and Sal Singh. The police won't do anything about it. And if they won't look for Jamie then Pip will, uncovering more of her town's dark secrets along the way... and this time everyone is listening. But will she find him before it's too late?", "price": "11.20", "rating": "4.39", "image_url": "https://m.media-amazon.com/images/I/41I-nm31zmL._AC_SY780_.jpg", "image": "41I-nm31zmL._AC_SY780_.jpg"}}, {"model": "products.product", "pk": 45, "fields": {"category": 5, "sku": "pp5004230059", "name": "Guard Your Heart", "author": "Sue Divin", "description": "Derry. Summer 2016. Aidan and Iona, now eighteen, were both born on the day of the Northern Ireland peace deal. Aidan is Catholic, Irish, and Republican. With his expolitical prisoner father gone and his mother dead, Aidan's hope is pinned on exam results earning him a one-way ticket out of Derry. To anywhere. Iona, Protestant and British, has a brother and father in the police. She's got university ambitions, a strong faith and a fervent belief that boys without one track minds are a myth. At a post-exam party, Aidan wanders alone across the Peace Bridge and becomes the victim of a brutal sectarian attack. Iona witnessed the attack; picked up Aidan's phone and filmed what happened, and got in touch with him to return the phone. When the two meet, alone and on neutral territory, the differences between them seem insurmountable. Both their fathers held guns, but safer to keep that secret for now Despite their differences and the secrets they have to keep from each other, there is mutual intrigue, and their friendship grows. And so what? It's not the Troubles. But for both Iona and Aidan it seems like everything is keeping them apart , when all they want is to be together . . . (less) GET A COPY", "price": "11.20", "rating": "4.12", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51xsfGDrjGL.jpg", "image": "51xsfGDrjGL.jpg"}}, {"model": "products.product", "pk": 46, "fields": {"category": 5, "sku": "pp5004310089", "name": "Two for Joy", "author": "Zoe Sugg", "description": "Audrey and Ivy, determined to bring their fellow student Lola Radcliffe's killer to justice, find themselves in the middle of another mystery when a friend disappears in suspicious circumstances. Their only clue is a mysterious card left by the enigmatic Magpie Society. With time running out and the police baffled, Audrey and Ivy must delve deeper than ever into the dark secrets that their school is hiding. But someone is playing a deadly game. And to beat them, Audrey and Ivy have to start rewriting the rules...", "price": "16.80", "rating": "4.50", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1634197354l/56871462._SY475_.jpg", "image": "56871462._SY475_.jpg"}}, {"model": "products.product", "pk": 47, "fields": {"category": 5, "sku": "pp5004610254", "name": "Konitz Dots and Stripes Set of 2 Bone China Mugs", "author": "Ali Hazelwood", "description": "As a third-year Ph.D. candidate, Olive Smith doesn't believe in lasting romantic relationships--but her best friend does, and that's what got her into this situation. Convincing Anh that Olive is dating and well on her way to a happily ever after was always going to take more than hand-wavy Jedi mind tricks: Scientists require proof. So, like any self-respecting biologist, Olive panics and kisses the first man she sees. That man is none other than Adam Carlsen, a young hotshot professor--and well-known ass. Which is why Olive is positively floored when Stanford's reigning lab tyrant agrees to keep her charade a secret and be her fake boyfriend. But when a big science conference goes haywire, putting Olive's career on the Bunsen burner, Adam surprises her again with his unyielding support and even more unyielding... six-pack abs. Suddenly their little experiment feels dangerously close to combustion. And Olive discovers that the only thing more complicated than a hypothesis on love is putting her own heart under the microscope.", "price": "12.60", "rating": "4.36", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81kYj5Uyu8L.jpg", "image": "81kYj5Uyu8L.jpg"}}, {"model": "products.product", "pk": 48, "fields": {"category": 5, "sku": "pp5004650050", "name": "Shadow and Bone", "author": "Leigh Bardugo", "description": "Surrounded by enemies, the once-great nation of Ravka has been torn in two by the Shadow Fold, a swath of near impenetrable darkness crawling with monsters who feast on human flesh. Now its fate may rest on the shoulders of one lonely refugee. Alina Starkov has never been good at anything. But when her regiment is attacked on the Fold and her best friend is brutally injured, Alina reveals a dormant power that saves his life—a power that could be the key to setting her war-ravaged country free. Wrenched from everything she knows, Alina is whisked away to the royal court to be trained as a member of the Grisha, the magical elite led by the mysterious Darkling. Yet nothing in this lavish world is what it seems. With darkness looming and an entire kingdom depending on her untamed power, Alina will have to confront the secrets of the Grisha . . . and the secrets of her heart.", "price": "11.20", "rating": "3.96", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91i7MSrNHXL.jpg", "image": "91i7MSrNHXL.jpg"}}, {"model": "products.product", "pk": 49, "fields": {"category": 5, "sku": "pp5004821375", "name": "The Cruel Prince", "author": "Holly Black", "description": "This is a previously published cover edition of ISBN 9780316310277. An alternative cover edition for this ISBN can be found here.Of course I want to be like them. They're beautiful as blades forged in some divine fire. They will live forever. And Cardan is even more beautiful than the rest. I hate him more than all the others. I hate him so much that sometimes when I look at him, I can hardly breathe. Jude was seven when her parents were murdered and she and her two sisters were stolen away to live in the treacherous High Court of Faerie. Ten years later, Jude wants nothing more than to belong there, despite her mortality. But many of the fey despise humans. Especially Prince Cardan, the youngest and wickedest son of the High King. To win a place at the Court, she must defy him and face the consequences. As Jude becomes more deeply embroiled in palace intrigues and deceptions, she discovers her own capacity for trickery and bloodshed. But as betrayal threatens to drown the Courts of Faerie in violence, Jude will need to risk her life in a dangerous alliance to save her sisters, and Faerie itself.", "price": "12.60", "rating": "4.10", "image_url": "https://kbimages1-a.akamaihd.net/0feaa855-7baa-4bf1-9756-b931e138d75c/1200/1200/False/the-cruel-prince-the-folk-of-the-air.jpg", "image": "the-cruel-prince-the-folk-of-the-air.jpg"}}, {"model": "products.product", "pk": 50, "fields": {"category": 6, "sku": "pp5004900522", "name": "Pride and Prejudice", "author": "Jane Austen", "description": "Since its immediate success in 1813, Pride and Prejudice has remained one of the most popular novels in the English language. Jane Austen called this brilliant work 'her own darling child' and its vivacious heroine, Elizabeth Bennet, 'as delightful a creature as ever appeared in print.' The romantic clash between the opinionated Elizabeth and her proud beau, Mr. Darcy, is a splendid performance of civilised sparring. And Jane Austen's radiant wit sparkles as her characters dance a delicate quadrille of flirtation and intrigue, making this book the most superb comedy of manners of Regency England.", "price": "9.80", "rating": "4.28", "image_url": "https://almabooks.com/wp-content/uploads/2016/10/9781847493699.jpg", "image": "9781847493699.jpg"}}, {"model": "products.product", "pk": 51, "fields": {"category": 6, "sku": "pp5004910158", "name": "Stylus Short-Sleeve V-Neck Slub Tee - Plus", "author": "Daphne Du Maurier", "description": "Last night I dreamt I went to Manderley again . . .The novel begins in Monte Carlo, where our heroine is swept off her feet by the dashing widower Maxim de Winter and his sudden proposal of marriage. Orphaned and working as a lady's maid, she can barely believe her luck. It is only when they arrive at his massive country estate that she realises how large a shadow his late wife will cast over their lives--presenting her with a lingering evil that threatens to destroy their marriage from beyond the grave.", "price": "12.60", "rating": "4.24", "image_url": "https://cdn.waterstones.com/bookjackets/large/9781/8440/9781844080380.jpg", "image": "9781844080380.jpg"}}, {"model": "products.product", "pk": 52, "fields": {"category": 6, "sku": "pp5004910477", "name": "Dracula", "author": "Bram Stoker", "description": "A rich selection of background and source materials is provided in three areas: Contexts includes probable inspirations for Dracula in the earlier works of James Malcolm Rymer and Emily Gerard. Also included are a discussion of Stoker's working notes for the novel and 'Dracula's Guest,' the original opening chapter to Dracula. Reviews and Reactions reprints five early reviews of the novel. 'Dramatic and Film Variations' focuses on theatre and film adaptations of Dracula, two indications of the novel's unwavering appeal. David J. Skal, Gregory A. Waller, and Nina Auerbach offer their varied perspectives. Checklists of both dramatic and film adaptations are included. Criticism collects seven theoretical interpretations of Dracula by Phyllis A. Roth, Carol A. Senf, Franco Moretti, Christopher Craft, Bram Dijkstra, Stephen D. Arata, and Talia Schaffer. A Chronology and a Selected Bibliography are included.", "price": "3.99", "rating": "4.01", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91wOUFZCE+L.jpg", "image": "91wOUFZCE+L.jpg"}}, {"model": "products.product", "pk": 53, "fields": {"category": 6, "sku": "pp5004940703", "name": "Little Women", "author": "Louisa May Alcott", "description": "Generations of readers young and old, male and female, have fallen in love with the March sisters of Louisa May Alcott's most popular and enduring novel, Little Women. Here are talented tomboy and author-to-be Jo, tragically frail Beth, beautiful Meg, and romantic, spoiled Amy, united in their devotion to each other and their struggles to survive in New England during the Civil War. It is no secret that Alcott based Little Women on her own early life. While her father, the freethinking reformer and abolitionist Bronson Alcott, hobnobbed with such eminent male authors as Emerson, Thoreau, and Hawthorne, Louisa supported herself and her sisters with 'woman's work,' including sewing, doing laundry, and acting as a domestic servant. But she soon discovered she could make more money writing. Little Women brought her lasting fame and fortune, and far from being the 'girl's book' her publisher requested, it explores such timeless themes as love and death, war and peace, the conflict between personal ambition and family responsibilities, and the clash of cultures between Europe and America.", "price": "9.80", "rating": "4.12", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91l1EHFs8dL.jpg", "image": "91l1EHFs8dL.jpg"}}, {"model": "products.product", "pk": 54, "fields": {"category": 6, "sku": "pp5004991006", "name": "The Picture of Dorian Gray", "author": "Oscar Wilde", "description": "With an Introduction and Notes by John M.L. Drew, University of Buckingham. Wilde's only novel, first published in 1890, is a brilliantly designed puzzle, intended to tease conventional minds with its exploration of the myriad interrelationships between art, life, and consequence. From its provocative Preface, challenging the reader to believe in 'art for art's sake', to its sensational conclusion, the story self-consciously experiments with the notion of sin as an element of design. Yet Wilde himself underestimated the consequences of his experiment, and its capacity to outrage the Victorian establishment. Its words returned to haunt him in his court appearances in 1895, and he later recalled the 'note of doom' which runs like 'a purple thread' through its carefully crafted prose.", "price": "3.99", "rating": "4.10", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71Yl9WYd4+S.jpg", "image": "71Yl9WYd4+S.jpg"}}, {"model": "products.product", "pk": 55, "fields": {"category": 6, "sku": "pp5004991162", "name": "adidas climacool Boxer Briefs", "author": "Arizona Original Bootcut Jeans", "description": "These climacool mesh boxer briefs are the ideal blend of performance and comfort, with a streamlined fit to complement your body's movement. fabric combines soft finish with moisture-wicking management mesh panels for ventilation double-lined support pouch no ride-up leg construction non-chafing stitching tag free polyester/spandex washable imported", "price": "28.99", "rating": "4.50", "image_url": "http://s7d9.scene7.com/is/image/JCPenney/DP0428201617042837M.tif?hei=380&amp;wid=380&op_usm=.4,.8,0,0&resmode=sharp2&op_usm=1.5,.8,0,0&resmode=sharp", "image": "DP0428201617042837M.jpg"}}, {"model": "products.product", "pk": 56, "fields": {"category": 6, "sku": "pp5005000046", "name": "The Great Gatsby", "author": "F. Scott Fitzgerald", "description": "The Great Gatsby, F. Scott Fitzgerald's third book, stands as the supreme achievement of his career. This exemplary novel of the Jazz Age has been acclaimed by generations of readers. The story is of the fabulously wealthy Jay Gatsby and his new love for the beautiful Daisy Buchanan, of lavish parties on Long Island at a time when The New York Times noted 'gin was the national drink and sex the national obsession,' it is an exquisitely crafted tale of America in the 1920s.", "price": "3.50", "rating": "3.93", "image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7a/The_Great_Gatsby_Cover_1925_Retouched.jpg", "image": "The_Great_Gatsby_Cover_1925_Retouched.jpg"}}, {"model": "products.product", "pk": 57, "fields": {"category": 6, "sku": "pp5005070254", "name": "Ulysses", "author": "James Joyce", "description": "Loosely based on the Odyssey, this landmark of modern literature follows ordinary Dubliners in 1904. Capturing a single day in the life of Dubliner Leopold Bloom, his friends Buck Mulligan and Stephen Dedalus, his wife Molly, and a scintillating cast of supporting characters, Joyce pushes Celtic lyricism and vulgarity to splendid extremes. Captivating experimental techniques range from interior monologues to exuberant wordplay and earthy humour. A major achievement in 20th century literature.", "price": "3.99", "rating": "3.74", "image_url": "https://c8.alamy.com/comp/EXTFE5/1960s-uk-ulysses-book-cover-EXTFE5.jpg", "image": "1960s-uk-ulysses-book-cover-EXTFE5.jpg"}}, {"model": "products.product", "pk": 58, "fields": {"category": 6, "sku": "pp5005071145", "name": "The Murder at the Vicarage", "author": "Agatha Christie", "description": "The Murder at the Vicarage is Agatha Christie's first mystery to feature the beloved investigator Miss Marple as a dead body in a clergyman's study proves to the indomitable sleuth that no place, holy or otherwise, is a sanctuary from homicide. Miss Marple encounters a compelling murder mystery in the sleepy little village of St. Mary Mead, where under the seemingly peaceful exterior of an English country village lurks intrigue, guilt, deception and death. Colonel Protheroe, local magistrate and overbearing land-owner is the most detested man in the village. Everyone even in the vicar wishes he were dead. And very soon he is shot in the head in the vicar's own study. Faced with a surfeit of suspects, only the inscrutable Miss Marple can unravel the tangled web of clues that will lead to the unmasking of the killer.", "price": "12.59", "rating": "4.06", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1328343048l/11602151.jpg", "image": "1328343048l/11602151.jpg"}}, {"model": "products.product", "pk": 59, "fields": {"category": 6, "sku": "pp5005140282", "name": "Frankenstein: The 1818 Text", "author": "Mary Wollstonecraft Shelley", "description": "Mary Shelley's seminal novel of the scientist whose creation becomes a monster This edition is the original 1818 text, which preserves the hard-hitting and politically charged aspects of Shelley's original writing, as well as her unflinching wit and strong female voice. This edition also includes a new introduction and suggestions for further reading by author and Shelley expert Charlotte Gordon, literary excerpts and reviews selected by Gordon and a chronology and essay by preeminent Shelley scholar Charles E. Robinson.", "price": "3.99", "rating": "3.83", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61O0anb7sjL.jpg", "image": "61O0anb7sjL.jpg"}}, {"model": "products.product", "pk": 60, "fields": {"category": 7, "sku": "pp5005200166", "name": "Court of Silver Flames", "author": "Sarah J. Maas", "description": "Nesta Archeron has always been prickly-proud, swift to anger, and slow to forgive. And ever since being forced into the Cauldron and becoming High Fae against her will, she's struggled to find a place for herself within the strange, deadly world she inhabits. Worse, she can't seem to move past the horrors of the war with Hybern and all she lost in it. The one person who ignites her temper more than any other is Cassian, the battle-scarred warrior whose position in Rhysand and Feyre's Night Court keeps him constantly in Nesta's orbit. But her temper isn't the only thing Cassian ignites. The fire between them is undeniable, and only burns hotter as they are forced into close quarters with each other. Meanwhile, the treacherous human queens who returned to the Continent during the last war have forged a dangerous new alliance, threatening the fragile peace that has settled over the realms. And the key to halting them might very well rely on Cassian and Nesta facing their haunting pasts. Against the sweeping backdrop of a world seared by war and plagued with uncertainty, Nesta and Cassian battle monsters from within and without as they search for acceptance-and healing-in each other's arms.", "price": "21.00", "rating": "4.40", "image_url": "https://www.norli.no/media/catalog/product/cache/c4a11e66ee9433953f551e1adfcb16b9/9/7/9781526620644_1_4.jpg", "image": "9781526620644_1_4.jpg"}}, {"model": "products.product", "pk": 61, "fields": {"category": 7, "sku": "pp5005210241", "name": "Project Hail Mary", "author": "Andy Weir", "description": "Ryland Grace is the sole survivor on a desperate, last-chance mission and if he fails, humanity and the Earth itself will perish.Except that right now, he doesn't know that. He can't even remember his own name, let alone the nature of his assignment or how to complete it. All he knows is that he's been asleep for a very, very long time. And he's just been awakened to find himself millions of miles from home, with nothing but two corpses for company. His crewmates dead, his memories fuzzily returning, he realises that an impossible task now confronts him. Alone on this tiny ship that's been cobbled together by every government and space agency on the planet and hurled into the depths of space, it's up to him to conquer an extinction level threat to our species. And thanks to an unexpected ally, he just might have a chance. Part scientific mystery, part dazzling interstellar journey, Project Hail Mary is a tale of discovery, speculation, and survival to rival The Martian while taking us to places it never dreamed of going. ", "price": "18.20", "rating": "4.53", "image_url": "https://www.easons.com/globalassets/book-covers/2021-01/project-hail-mary.png", "image": "project-hail-mary.png"}}, {"model": "products.product", "pk": 62, "fields": {"category": 7, "sku": "pp5005280104", "name": "A Court of Frost and Starlight", "author": "Sarah J. Maas", "description": "Feyre, Rhys, and their close-knit circle of friends are still busy rebuilding the Night Court and the vastly changed world beyond. But Winter Solstice is finally near, and, with it, a hard earned reprieve. Yet even the festive atmosphere can't keep the shadows of the past from looming. As Feyre navigates her first Winter Solstice as High Lady, she finds that those dearest to her have more wounds than she anticipated scars that will have a far reaching impact on the future of their court. Narrated by Feyre and Rhysand, this wondrous tale of hope and promise picks up after A Court of Wings and Ruin and sets the stage for the thrilling events in the future books. ", "price": "11.20", "rating": "3.81", "image_url": "https://www.norli.no/media/catalog/product/cache/c4a11e66ee9433953f551e1adfcb16b9/9/7/9781526617187_1_5.jpg", "image": "9781526617187_1_5.jpg"}}, {"model": "products.product", "pk": 63, "fields": {"category": 7, "sku": "pp5005310360", "name": "The Silence of the Girls", "author": "Pat Barker", "description": "The ancient city of Troy has withstood a decade under siege by the powerful Greek army, which continues to wage bloody war over a stolen woman Helen. In the Greek camp, another woman Briseis watches and waits for the war's outcome. She was queen of one of Troy's neighboring kingdoms, until Achilles, Greece's greatest warrior, sacked her city and murdered her husband and brothers. Briseis becomes Achilles's concubine, a prize of battle, and must adjust quickly in order to survive a radically different life, as one of the many conquered women who serve the Greek army. When Agamemnon, the brutal political leader of the Greek forces, demands Briseis for himself, she finds herself caught between the two most powerful of the Greeks. Achilles refuses to fight in protest, and the Greeks begin to lose ground to their Trojan opponents. Keenly observant and coolly unflinching about the daily horrors of war, Briseis finds herself in an unprecedented position, able to observe the two men driving the Greek army in what will become their final confrontation, deciding the fate not only of Briseis's people but also of the ancient world at large. Briseis is just one among thousands of women living behind the scenes in this war the slaves and prostitutes, the nurses, the women who lay out the dead all of them erased by history. With breathtaking historical detail and luminous prose, Pat Barker brings the teeming world of the Greek camp to vivid life. She offers nuanced, complex portraits of characters and stories familiar from mythology, which, seen from Briseis's perspective, are rife with newfound revelations. Barker's latest builds on her decades-long study of war and its impact on individual lives and it is nothing short of magnificent. ", "price": "12.60", "rating": "3.92", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91WbTtMDZ+L.jpg", "image": "91WbTtMDZ+L.jpg"}}, {"model": "products.product", "pk": 64, "fields": {"category": 7, "sku": "pp5005330595", "name": "Arizona Graphic Tee - Boys 8-20 and Husky", "author": "Schwab V E", "description": "A Life No One Will Remember. A Story You Will Never Forget. France, 1714: in a moment of desperation, a young woman makes a Faustian bargain to live forever and is cursed to be forgotten by everyone she meets. Thus begins the extraordinary life of Addie LaRue, and a dazzling adventure that will play out across centuries and continents, across history and art, as a young woman learns how far she will go to leave her mark on the world. But everything changes when, after nearly 300 years, Addie stumbles across a young man in a hidden bookstore and he remembers her name. ", "price": "19.60", "rating": "4.23", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91Ql48Y0mqL.jpg", "image": "91Ql48Y0mqL.jpg"}}, {"model": "products.product", "pk": 65, "fields": {"category": 7, "sku": "pp5005330596", "name": "Dune", "author": "Frank Herbert", "description": "Set on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, heir to a noble family tasked with ruling an inhospitable world where the only thing of value is the 'spice' melange, a drug capable of extending life and enhancing consciousness. Coveted across the known universe, melange is a prize worth killing for...When House Atreides is betrayed, the destruction of Paul's family will set the boy on a journey toward a destiny greater than he could ever have imagined. And as he evolves into the mysterious man known as Muad'Dib, he will bring to fruition humankind's most ancient and unattainable dream.", "price": "14.00", "rating": "4.00", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81ym3QUd3KL.jpg", "image": "81ym3QUd3KL.jpg"}}, {"model": "products.product", "pk": 66, "fields": {"category": 7, "sku": "pp5005430914", "name": "The Eye of the World", "author": "Robert Jordan", "description": "The Wheel of Time turns and Ages come and pass. What was, what will be, and what is, may yet fall under the Shadow. Let the Dragon ride again on the winds of time. The Wheel of Time turns and Ages come and go, leaving memories that become legend. Legend fades to myth, and even myth is long forgotten when the Age that gave it birth returns again. In the Third Age, an Age of Prophecy, the World and Time themselves hang in the balance. What was, what will be, and what is, may yet fall under the Shadow. When The Two Rivers is attacked by Trollocs-a savage tribe of half-men, half-beasts- five villagers flee that night into a world they barely imagined, with new dangers waiting in the shadows and in the light.", "price": "14.00", "rating": "4.18", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91cJ0-MXtGL.jpg", "image": "91cJ0-MXtGL.jpg"}}, {"model": "products.product", "pk": 67, "fields": {"category": 7, "sku": "pp5005430944", "name": "These Violent Delights", "author": "Chloe Gong", "description": "The year is 1926, and Shanghai hums to the tune of debauchery. A blood feud between two gangs runs the streets red, leaving the city helpless in the grip of chaos. At the heart of it all is eighteen-year-old Juliette Cai, a former flapper who has returned to assume her role as the proud heir of the Scarlet Gang a network of criminals far above the law. Their only rivals in power are the White Flowers, who have fought the Scarlets for generations. And behind every move is their heir, Roma Montagov, Juliette's first love, and first betrayal. But when gangsters on both sides show signs of instability culminating in clawing their own throats out, the people start to whisper. Of a contagion, a madness. Of a monster in the shadows. As the deaths stack up, Juliette and Roma must set their guns and grudges aside and work together, for if they can't stop this mayhem, then there will be no city left for either to rule. Perfect for fans of The Last Magician and Descendant of the Crane, this heart-stopping debut is an imaginative Romeo and Juliet retelling set in 1920s Shanghai, with rival gangs and a monster in the depths of the Huangpu River.", "price": "72.99", "rating": "4.00", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91a9UDAbngL.jpg", "image": "91a9UDAbngL.jpg"}}, {"model": "products.product", "pk": 68, "fields": {"category": 7, "sku": "pp5005510265", "name": "Pet Sematary", "author": "Stephen King", "description": "When the Creeds move into a beautiful old house in rural Maine, it all seems too good to be true: physician father, beautiful wife, charming little daughter, adorable infant son-and now an idyllic home. As a family, they've got it all...right down to the friendly car. But the nearby woods hide a blood-chilling truth-more terrifying than death itself-and hideously more powerful. The Creeds are going to learn that sometimes dead is better.", "price": "14.00", "rating": "4.03", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91ndIrptO4L.jpg", "image": "91ndIrptO4L.jpg"}}, {"model": "products.product", "pk": 69, "fields": {"category": 7, "sku": "pp5005520201", "name": "Realm Breaker", "author": "Victoria Aveyard", "description": "A strange darkness grows in Allward. Even Corayne an-Amarat can feel it, tucked away in her small town at the edge of the sea. She soon discovers the truth: She is the last of an ancient lineage and the last hope to save the world from destruction. But she won't be alone. Even as darkness falls, she is joined by a band of unlikely companions: A squire, forced to choose between home and honour. An immortal, avenging a broken promise. An assassin, exiled and bloodthirsty. An ancient sorceress, whose riddles hide an eerie foresight. A forger with a secret past. A bounty hunter with a score to settle. Together they stand against a vicious opponent, invincible and determined to burn all kingdoms to ash, and an army unlike anything the realm has ever witnessed.", "price": "19.60", "rating": "3.68", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51+QySyLaXS._SX329_BO1,204,203,200_.jpg", "image": "51+QySyLaXS._SX329_BO1,204,203,200_.jpg"}}, {"model": "products.product", "pk": 70, "fields": {"category": 8, "sku": "pp5005520205", "name": "The Book of Cold Cases", "author": "Simone St. James", "description": "In 1977, Claire Lake, Oregon, was shaken by the Lady Killer Murders: Two men, seemingly randomly, were murdered with the same gun, with strange notes left behind. Beth Greer was the perfect suspect--a rich, eccentric twenty-three-year-old woman, seen fleeing one of the crimes. But she was acquitted, and she retreated to the isolation of her mansion. Oregon, 2017. Shea Collins is a receptionist, but by night, she runs a true crime website, the Book of Cold Cases--a passion fueled by the attempted abduction she escaped as a child. When she meets Beth by chance, Shea asks her for an interview. To Shea's surprise, Beth says yes. They meet regularly at Beth's mansion, though Shea is never comfortable there. Items move when she's not looking, and she could swear she's seen a girl outside the window. The allure of learning the truth about the case from the smart, charming Beth is too much to resist, but even as they grow closer, Shea senses something isn't right. Is she making friends with a manipulative murderer, or are there other dangers lurking in the darkness of the Greer house? A true crime blogger gets more than she bargained for while interviewing the woman acquitted of two cold case slayings in this chilling new novel from the New York Times bestselling author of The Sun Down Motel.", "price": "18.99", "rating": "3.96", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91UDguUf+cL.jpg", "image": "91UDguUf+cL.jpg"}}, {"model": "products.product", "pk": 71, "fields": {"category": 8, "sku": "pp5005630545", "name": "The Match", "author": "Harlan Coben", "description": "Wilde has grown up knowing nothing of his family, and even less about his own identity . All he knows is that, as a young child, he was found living a feral existence in the Ramapo mountains of New Jersey. He became known simply as Wilde, the boy from the woods. Now Wilde has had a hit on the DNA website he has been researching. A 100% match. His father. They meet up, and Wilde soon realises that his father doesn't even know he had a son and is as mystified as Wilde is by his existence. Undaunted, Wilde continues his research for his family on DNA websites where he becomes caught up in a community of online doxxers, a secret group committed to exposing anonymous trolls. Then one by one these doxxers start to die, and it soon becomes clear that a serial killer is targeting this secret community - and that his next victim might be Wilde himself ... ", "price": "18.99", "rating": "4.34", "image_url": "https://images-na.ssl-images-amazon.com/images/I/516z-D3WmCL._SX329_BO1,204,203,200_.jpg", "image": "516z-D3WmCL._SX329_BO1,204,203,200_.jpg"}}, {"model": "products.product", "pk": 72, "fields": {"category": 8, "sku": "pp5005630605", "name": "My Dearest Darkest", "author": "Kayla Cottingham", "description": "Finch Chamberlin is the newest transfer student to the ultra-competitive Ulalume Academy... but she's also not what she seems. Months before school started, Finch and her parents got into an accident that should have left her dead at the bottom of a river. But something monstrous, and ancient, and terrifying, wouldn't let her drown. Finch doesn't know why she woke up after her heart stopped, but since dying she's felt a constant pull from the school and the surrounding town of Rainwater, like something on the island is calling to her. Selena St. Clair sees right through Finch, and she knows something is seriously wrong with her. But despite Selena's suspicion, she feels drawn to Finch and has a sinking feeling that from now on the two will be inexplicably linked to one another. One night Finch, Selena, and her friends accidentally summon a carnivorous creature of immense power in the depths of the school. It promises to grant every desire the girls have kept locked away in their insecure hearts beauty, power, adoration in exchange for a price: human body parts. But as the cost of their wanting becomes more deadly, Finch and Selena must learn to work together to stop the horror they unleashed, before it consumes the entire island.", "price": "10.99", "rating": "3.89", "image_url": "https://images-na.ssl-images-amazon.com/images/I/919iXZLwgrL.jpg", "image": "919iXZLwgrL.jpg"}}, {"model": "products.product", "pk": 73, "fields": {"category": 8, "sku": "pp5005630637", "name": "Tell Me Everything: The Story of a Private Investigation", "author": "Erika Krouse", "description": "Erika Krouse has one of those faces. 'I don't know why I'm telling you this,' people say, spilling confessions. In fall 2002, Krouse accepted a new contract job investigating lawsuits as a private investigator. The role seems perfect for her, but she quickly realises she has no idea what she's doing. Then a lawyer named Grayson assigns her to investigate a sexual assault, a college student who was attacked by football players and recruits at a party a year earlier. Krouse knows she should turn the assignment down; her own history with sexual violence makes it all too personal. But she takes the job anyway, inspired by Grayson's conviction that he could help change things forever--and maybe she could, too. Over the next five years, Krouse learns everything she can about P. I. technique, tracking down witnesses and investigating a culture of sexual assault and harassment ingrained in the university's football program. But as the investigation grows into a national scandal and a historic civil rights case, she finds herself increasingly consumed. When the case and her life both implode at the same time, she must figure out how to help win the case without losing herself.", "price": "10.99", "rating": "3.80", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91totM2rThS.jpg", "image": "91totM2rThS.jpg"}}, {"model": "products.product", "pk": 74, "fields": {"category": 8, "sku": "pp5005630638", "name": "Tell Me an Ending", "author": "Jo Harkin", "description": "Across the world, thousands of people are shocked by a notification that they once chose to have a memory removed. Now they are being given an opportunity to get that memory back. Four individuals are filled with new doubts, grappling with the unexpected question of whether to remember unknown events, or to leave them buried forever. Finn, an Irish architect living in the Arizona desert, begins to suspect his charming wife of having an affair. Mei, a troubled grad school dropout in Kuala Lumpur, wonders why she remembers a city she has never visited. William, a former police inspector in England, struggles with PTSD, the breakdown of his marriage, and his own secret family history. Oscar, a handsome young man with almost no memories at all, travels the world in a constant state of fear. Into these characters' lives comes Noor, a psychologist working at the Nepenthe memory removal clinic in London. The process of reinstating patients' memories begins to shake the moral foundations of her world. As she delves deeper into how the program works, she will have to risk everything to uncover the cost of this miraculous technology.A provocative exploration of secrets, grief, and identity of the stories we tell ourselves Tell Me an Ending is a sharp, dark, and devastating novel about the power of memory Never Let Me Go meets Black Mirror in this thrilling speculative debut about a tech company that deletes unwanted memories, the consequences for those forced to contend with what they tried to forget, and the dissenting doctor who seeks to protect her patients from further harm.", "price": "15.99", "rating": "3.70", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91UlKL3QpTL.jpg", "image": "91UlKL3QpTL.jpg"}}, {"model": "products.product", "pk": 75, "fields": {"category": 8, "sku": "pp5005650677", "name": "The Club", "author": "Ellery Lloyd", "description": "The Home Group is a glamorous collection of celebrity members' clubs dotted across the globe, where the rich and famous can party hard and then crash out in its five-star suites, far from the prying eyes of fans and the media. The most spectacular of all is Island Home a closely-guarded, ultraluxurious resort, just off the English coast and its three-day launch party is easily the most coveted A-list invite of the decade. But behind the scenes, tensions are at breaking point: the ambitious and expensive project has pushed the Home Group's CEO and his long-suffering team to their absolute limits. All of them have something to hide and that's before the beautiful people with their own ugly secrets even set foot on the island. As tempers fray and behaviour worsens, as things get more sinister by the hour and the body count piles up, some of Island Home's members will begin to wish they'd never made the guest list. Because at this club, if your name's on the list, you're not getting out.", "price": "18.99", "rating": "3.48", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71zxq-LTYbL.jpg", "image": "71zxq-LTYbL.jpg"}}, {"model": "products.product", "pk": 76, "fields": {"category": 8, "sku": "pp5005700140", "name": "Remember Me Gone", "author": "Stacy Stokes", "description": "Lucy Miller's family has the unique ability to remove people's painful memories--but Lucy isn't prepared for the truths she will uncover. People come from everywhere to forget. At the Memory House, in Tumble Tree, Texas, Lucy's father can literally erase folks' heartache and tragic memories. Lucy can't wait to learn the family trade and help alleviate others' pain, and now, at sixteen, she finally can. But everything is not as it seems. When Lucy practices memory-taking on her dad, his memory won't come loose, and in the bit that Lucy sees, there's a flash of Mama on the day she died, tinged red with guilt. Then Lucy wakes up the next morning with a bruised knee, a pocketful of desert sand, and no memory of what happened. She has no choice but to listen to Marco Warman--a local boy she's always wondered about, who seems to know more than he should. As Lucy and Marco realise there are gaps in their own memories, they team up to fill in the missing pieces--to figure out what's really going on in their town, and to uncover their own stolen history along the way. But as the mysteries pile up one thing becomes certain: There are some secrets people will do anything to keep. ", "price": "20.99", "rating": "4.08", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91nFH1d6lqL.jpg", "image": "91nFH1d6lqL.jpg"}}, {"model": "products.product", "pk": 77, "fields": {"category": 8, "sku": "pp5005740430", "name": "This Golden State", "author": "Marit Weisenberg", "description": "The Winslow family lives by five principles: 1. No one can know your real name. 2. Don't stay in one place too long. 3. If you sense anything is wrong, go immediately to the meeting spot. 4. Keeping our family together is everything. 5. We wish we could tell you who we are, but we can't. Please do not ask. Poppy doesn't know why her family has been running her whole life, but she does know that there are dire consequences if they're ever caught. Still, her curiosity grows each year, as does her desire for real friends and the chance to build on something, instead of leaving behind school projects, teams, and crushes at a moment's notice. When a move to California exposes a crack in her parents' airtight planning, Poppy realises how fragile her world is. Determined to find out the truth, she mails in a home DNA test. Just as she starts to settle into her new life and even begins opening up to a boy in her maths class, the forgotten test results bring her crashing back to reality. Unravelling the shocking truth of her parents' real identities, Poppy realises that the DNA test has undone decades of careful work to keep her family anonymous and the past is dangerously close to catching up to them. Determined to protect her family but desperate for more, Poppy must ask: How much of herself does she owe her family? And is it a betrayal to find her own place in the world?", "price": "16.99", "rating": "4.19", "image_url": "https://img1.od-cdn.com/ImageType-100/2390-1%7B0A74045E-378B-4B3E-BCCF-C46CB3824A3F%7DImg100.jpg/", "image": "%7B0A74045E-378B-4B3E-BCCF-C46CB3824A3F%7DImg100.jpg"}}, {"model": "products.product", "pk": 78, "fields": {"category": 8, "sku": "pp5005740561", "name": "Smile and Look Pretty", "author": "Amanda Pellegrino", "description": "A whip-smart, piercing debut novel, Smile and Look Pretty follows four assistants who band together to take on their toxic office environments in the ultimate comeuppance. Online they're the Aggressive One, the Bossy One, the Bitchy One and the Emotional One. In real life, best friends Cate, Lauren, Olivia and Max all have one thing in common--they're overworked, overtired and underpaid assistants to some of the most powerful men in the entertainment industries. When they secretly start an anonymous blog detailing their experiences, their posts go viral and hundreds of other women come forward with stories of their own. Confronted with the risks of newfound fame and the possibility of their identities being revealed, they have to contend with what happens when you try to change the world. Gripping, razor sharp and scathingly funny, Smile and Look Pretty is a fast-paced millennial rallying cry about the consequences of whistleblowing for an entire generation, and a testament to the strength of female friendship and what can be accomplished when women come together.", "price": "20.99", "rating": "3.79", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81qwagoRCdL.jpg", "image": "81qwagoRCdL.jpg"}}, {"model": "products.product", "pk": 79, "fields": {"category": 8, "sku": "pp5005740634", "name": "The Summer We Forgot", "author": "Caroline George", "description": "Caroline George once again transports readers with lush, evocative prose, leading them to ask the question: what happens when we can't even trust ourselves? Some memories are better left forgotten. Darby and Morgan haven't spoken for two years, and their friend group has splintered. But when the body of their former science teacher is found in the marsh where they attended camp that summer, they realize they have more questions than answers . . . and even fewer memories. No one remembers or no one is talking. The group of reunited friends begins to suspect that a murderer is stalking the coastal highway 30A, and they must try to recover their memories as quickly as possible . . . before the history they can't remember repeats itself. Everyone has a secret. As tensions rise and time runs out, Darby and Morgan begin to wonder if they can believe one another . . . or if they can even trust themselves.", "price": "10.99", "rating": "3.71", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51yst7Xx-GL._SX326_BO1,204,203,200_.jpg", "image": "51yst7Xx-GL._SX326_BO1,204,203,200_.jpg"}}, {"model": "products.product", "pk": 80, "fields": {"category": 9, "sku": "pp5005760088", "name": "A Brief History of Equality", "author": "Thomas Piketty", "description": "The world's leading economist of inequality presents a short but sweeping and surprisingly optimistic history of human progress toward equality despite crises, disasters, and backsliding. A perfect introduction to the ideas developed in his monumental earlier books. It's easy to be pessimistic about inequality. We know it has increased dramatically in many parts of the world over the past two generations. No one has done more to reveal the problem than Thomas Piketty. Now, in this surprising and powerful new work, Piketty reminds us that the grand sweep of history gives us reasons to be optimistic. Over the centuries, he shows, we have been moving toward greater equality. Piketty guides us with elegance and concision through the great movements that have made the modern world for better and worse: the growth of capitalism, revolutions, imperialism, slavery, wars, and the building of the welfare state. It's a history of violence and social struggle, punctuated by regression and disaster. But through it all, Piketty shows, human societies have moved fitfully toward a more just distribution of income and assets, a reduction of racial and gender inequalities, and greater access to health care, education, and the rights of citizenship. Our rough march forward is political and ideological, an endless fight against injustice. To keep moving, Piketty argues, we need to learn and commit to what works, to institutional, legal, social, fiscal, and educational systems that can make equality a lasting reality. At the same time, we need to resist historical amnesia and the temptations of cultural separatism and intellectual compartmentalization. At stake is the quality of life for billions of people. We know we can do better, Piketty concludes. The past shows us how. The future is up to us.", "price": "29.00", "rating": "4.09", "image_url": "https://m.media-amazon.com/images/I/31-y51sQV4L.jpg", "image": "31-y51sQV4L.jpg"}}, {"model": "products.product", "pk": 81, "fields": {"category": 9, "sku": "pp5005810108", "name": "A Short History of the Blockade", "author": "Leanne Betasamosake Simpson", "description": "In A Short History of the Blockade, award-winning writer Leanne Betasamosake Simpson uses Michi Saagiig Nishnaabeg stories, storytelling aesthetics, and practices to explore the generative nature of Indigenous blockades through our relative, the beaver or in Nishnaabemowin, Amik. Moving through genres, shifting through time, amikwag stories become a lens for the life-giving possibilities of dams and the world-building possibilities of blockades, deepening our understanding of Indigenous resistance, as both a negation and an affirmation. Widely recognized as one of the most compelling Indigenous voices of her generation, Simpson's work breaks open the intersections between politics, story, and song, bringing audiences into a rich and layered world of sound, light, and sovereign creativity. A Short History of the Blockade reveals how the practice of telling stories is also a culture of listening, 'a thinking through together,' and ultimately, like the dam or the blockade, an affirmation of life.", "price": "13.99", "rating": "4.36", "image_url": "https://images-na.ssl-images-amazon.com/images/I/41q6Uo1lcnL._SX342_SY445_QL70_ML2_.jpg", "image": "41q6Uo1lcnL._SX342_SY445_QL70_ML2_.jpg"}}, {"model": "products.product", "pk": 82, "fields": {"category": 9, "sku": "pp5005820197", "name": "The Secret History", "author": "Donna Tartt", "description": "Add a cosy layer to any game-ready style with this insulated performance hoodie, featuring a pullover design and Therma-FIT fabric for warmth. Therma-FIT microfiber fleece fabric keeps you warm and insulated mesh-lined hood for breathable coverage long sleeves ribbed cuffs and hem kangaroo pocket polyester washable imported", "price": "12.60", "rating": "4.14", "image_url": "https://images-na.ssl-images-amazon.com/images/I/91EWBiFTnGL.jpg", "image": "91EWBiFTnGL.jpg"}}, {"model": "products.product", "pk": 83, "fields": {"category": 9, "sku": "pp5005840598", "name": "Gender in History: Global Perspectives", "author": "Merry E. Wiesner", "description": "Updated with new material to reflect the latest developments in the field, Gender in History Global Perspectives, 2nd Edition, provides a concise overview of the construction of gender in world cultures from the Palaeolithic era to modern times. Includes examples drawn from the most recent scholarship relating to a diverse range of cultures, from Ancient Mesopotamia to post-Soviet Russia, and from the Igbo of Nigeria, to the Iroquois of north eastern North America. Reflects new developments in the field with added coverage of primates, slavery, colonialism, masculinity, and transgender issues Features significant discussion of the Paleolithic and Neolithic periods, an important trend in the study of world history Lays out key theoretical and methodological issues in an introduction that is written in accessible language Supplementary material for instructors and students available at www.wiley.com/go/wiesnerhanks", "price": "46.19", "rating": "3.83", "image_url": "https://media.wiley.com/product_data/coverImage300/29/14443517/1444351729.jpg", "image": "1444351729.jpg"}}, {"model": "products.product", "pk": 84, "fields": {"category": 9, "sku": "pp5005840776", "name": "History Has Begun", "author": "Bruno Maçães", "description": "Popular consensus says that the US rose over two centuries to Cold War victory and world domination, and is now in slow decline. But is this right? History's great civilisations have always lasted much longer, and for all its colossal power, the US was overshadowed by Europe until recently. What if this isn't the end? Bruno Maçães offers a compelling vision of America's future, both fascinating and unnerving. From the early American Republic, Maçães takes us to the turbulent present, when, he argues, America is finally forging its own path. We can see the birth pangs of this new civilisation in today's debates on guns, religion, foreign policy and the significance of Trump. What will its values be, and what will this new America look like?", "price": "18.19", "rating": "3.74", "image_url": "https://images-na.ssl-images-amazon.com/images/I/41d-ifxdSrL._SX327_BO1,204,203,200_.jpg", "image": "41d-ifxdSrL._SX327_BO1,204,203,200_.jpg"}}, {"model": "products.product", "pk": 85, "fields": {"category": 9, "sku": "pp5005850180", "name": "A Brief History of Time", "author": "Stephen Hawking", "description": "In the ten years since its publication in 1988, Stephen Hawking's classic work has become a landmark volume in scientific writing, with more than nine million copies in forty languages sold worldwide. That edition was on the cutting edge of what was then known about the origins and nature of the universe. But the intervening years have seen extraordinary advances in the technology of observing both the micro- and the macrocosmic worlds. These observations have confirmed many of Professor Hawking's theoretical predictions in the first edition of his book, including the recent discoveries of the Cosmic Background Explorer satellite (COBE), which probed back in time to within 300,000 years of the universe's beginning and revealed wrinkles in the fabric of space-time that he had projected. Eager to bring to his original text the new knowledge revealed by these observations, as well as his own recent research, Professor Hawking has prepared a new introduction to the book, written an entirely new chapter on wormholes and time travel, and updated the chapters throughout.", "price": "14.00", "rating": "4.20", "image_url": "https://dj4fsg3e1je59.cloudfront.net/9780857501004/img/0", "image": "0.jpg"}}, {"model": "products.product", "pk": 86, "fields": {"category": 9, "sku": "pp5005851218", "name": "The Secret History of Here: A Year in the Valley", "author": "Alistair Moffat", "description": "The Secret History of Here is the story of a single place, a farm in the Scottish Borders. The site on which Alistair Moffat's farm now stands has been occupied since prehistoric times. The fields have turned up ancient arrowheads, stone spindles, silver pennies and a stone carved with the rune-like letters of Ogham. Walking this landscape you can feel the presence and see the marks of those who lived here before. But it is also the story of everywhere. In uncovering the history of one piece of land, Moffat shows how history is all around us, if only we have the eyes to see it. Under our feet, carved into the landscape, in the layout of paths and roads, in the stories we pass down, our history leaves its trace on the land. Taking the form of a journal of a year, The Secret History of Here is a walk through the centuries as much as the seasons. We hear the echo of battles long since fought, of lives lived quietly or scandalously, of armies, of kings, of the common folk who mostly inhabited this land, and a little of those that live here now.", "price": "28.00", "rating": "4.18", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51z7N4qFGCL._SX323_BO1,204,203,200_.jpg", "image": "14201504201760M.jpg"}}, {"model": "products.product", "pk": 87, "fields": {"category": 9, "sku": "pp5005860175", "name": "A History of Coventry", "author": "David McGrory", "description": "In this highly researched and comprehensive book, the author argues for Coventry's Roman past, long doubted, and explores its Saxon roots as home to the monastic houses of St Osburg. He throws new light on Leofric and Godiva, including their involvement in the foundation or endowment of St Mary's Priory, and using recent excavation work he reveals the most up-to-date ideas on its appearance and its destruction. The city's later mediaeval past is explained in detail, including its rise to power in the Wars of the Roses, when the royal court moved to the city, and the connection with Henry VI and his cult. Details of the imprisonment of Mary, Queen of Scots, are given for the first time, while previously unused documents are used to tell the real story of life in Parliamentary Coventry and its famous Siege.Every aspect of daily life in the city is described in the well-illustrated narrative - how Coventry folk earned their living, from weaving to motor-cars, their health, education, religious life, entertainments and crime and punishment. No one who knows the city can fail to be intrigued by this classic book. It is a fund of fascinating information and has become the standard work on Coventry.", "price": "28.00", "rating": "4.80", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71NxsIt7iVS.jpg", "image": "71NxsIt7iVS.jpg"}}, {"model": "products.product", "pk": 88, "fields": {"category": 9, "sku": "pp5005860263", "name": "A History of Solitude", "author": "David Vincent", "description": "Solitude has always had an ambivalent status: the capacity to enjoy being alone can make sociability bearable, but those predisposed to solitude are often viewed with suspicion or pity. Drawing on a wide array of literary and historical sources, David Vincent explores how people have conducted themselves in the absence of company over the last three centuries. He argues that the ambivalent nature of solitude became a prominent concern in the modern era. For intellectuals in the romantic age, solitude gave respite to citizens living in ever more complex modern societies. But while the search for solitude was seen as a symptom of modern life, it was also viewed as a dangerous pathology: a perceived renunciation of the world, which could lead to psychological disorder and anti-social behaviour. Vincent explores the successive attempts of religious authorities and political institutions to manage solitude, taking readers from the monastery to the prisoner's cell, and explains how western society's increasing secularism, urbanisation and prosperity led to the development of new solitary pastimes at the same time as it made traditional forms of solitary communion, with God and with a pristine nature, impossible. At the dawn of the digital age, solitude has taken on new meanings, as physical isolation and intense sociability have become possible as never before. With the advent of a so-called loneliness epidemic, a proper historical understanding of the natural human desire to disengage from the world is more important than ever.", "price": "3.73", "rating": "4.00", "image_url": "https://images-na.ssl-images-amazon.com/images/I/41BYRtJEKEL._SX330_BO1,204,203,200_.jpg", "image": "41BYRtJEKEL._SX330_BO1,204,203,200_.jpg"}}, {"model": "products.product", "pk": 89, "fields": {"category": 9, "sku": "pp5005870183", "name": "The Plague", "author": "Albert Camus", "description": "A gripping tale of human unrelieved horror, of survival and resilience, and of the ways in which humankind confronts death, The Plague is at once a masterfully crafted novel, eloquently understated and epic in scope, and a parable of ageless moral resonance, profoundly relevant to our times. In Oran, a coastal town in North Africa, the plague begins as a series of portents, unheeded by the people. It gradually becomes an omnipresent reality, obliterating all traces of the past and driving its victims to almost unearthly extremes of suffering, madness, and compassion.", "price": "12.99", "rating": "4.02", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71D5OByLh0L.jpg", "image": "71D5OByLh0L.jpg"}}, {"model": "products.product", "pk": 90, "fields": {"category": 10, "sku": "pp5005870599", "name": "The Guinness Girls: A Hint of Scandal", "author": "Emily Hourican", "description": "It's the dawn of the 1930s and the three privileged Guinness sisters, Aileen, Maureen and Oonagh, settle into becoming wives and mothers: Aileen in Luttrellstown Castle outside Dublin, Maureen in Clandeboye in Northern Ireland, and Oonagh in Rutland Place in London. But while Britain becomes increasingly politically polarised, Aileen, Maureen and Oonagh discover conflict within their own marriages. Oonagh's dream of romantic love is countered by her husband's lies; the intense nature of Maureen's marriage means passion, but also rows; while Aileen begins to discover that, for her, being married offers far less than she had expected. Meanwhile, Kathleen, a housemaid from their childhood home in Glenmaroon, travels between the three sisters, helping, listening, watching - even as her own life brings her into conflict with the clash between fascism and communism. As affairs are uncovered and secrets exposed, the three women begin to realise that their gilded upbringing could not have prepared them for the realities of married life, nor for the scandals that seem to follow them around.", "price": "19.60", "rating": "3.63", "image_url": "https://m.media-amazon.com/images/I/41CjdYRow8L.jpg", "image": "41CjdYRow8L.jpg"}}, {"model": "products.product", "pk": 91, "fields": {"category": 10, "sku": "pp5005870638", "name": "Arizona Raglan-Sleeve Thermal Pullover", "author": "Eithne Shortall", "description": "Their school is about to be taught a lesson... Beverley Franklin will do whatever it takes to protect her local school's reputation. So when a scandal involving her own daughter threatens to derail the annual school musical's appearance on national television, Beverley goes into overdrive. But in her efforts to protect her daughter and keep the musical on track, she misses what's really going, both in her own house and in the insular Glass Lake community - with dramatic consequences. Glass Lake primary school's reputation is about to be shattered...", "price": "18.20", "rating": "3.97", "image_url": "https://www.biblioimages.com/atlantic/getimage.aspx?class=books&assetversionid=181450&cat=default&size=origjpg&id=7696", "image": "9781838951849.jpg"}}, {"model": "products.product", "pk": 92, "fields": {"category": 10, "sku": "pp5005910565", "name": "The Colony", "author": "Audrey Magee", "description": "The clarity of Colm Toibin's prose is blended with the emotional truth of Anne Enright in this stand-out new novel of belonging and loss. handed the easel to the boatman, reaching down the pier wall towards the sea. Mr Lloyd has decided to travel to the island by boat without engine - the authentic experience. Unbeknownst to him, Mr Masson will also soon be arriving for the summer. Both will strive to encapsulate the truth of this place - one in his paintings, the other with his faithful rendition of its speech, the language he hopes to preserve. But the people who live here on this rock - three miles wide and half-a-mile long - have their own views on what is being recorded, what is being taken and what is given in return. Over the summer each of the women and men in the household this French and Englishman join is forced to question what they value and what they desire. At the end of the summer, as the visitors head home, there will be a reckoning.", "price": "18.20", "rating": "4.30", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51MieO3H8pL._SX308_BO1,204,203,200_.jpg", "image": "51MieO3H8pL._SX308_BO1,204,203,200_.jpg"}}, {"model": "products.product", "pk": 93, "fields": {"category": 10, "sku": "pp5005930313", "name": "The Book Club", "author": "Roisin Meaney", "description": "A tragic accident leaves the tight-knit book club in the small seaside town of Fairweather reeling. Then stranger Tom McLysaght arrives in the community, and the members of the club find their lives changing in ways they never could have imagined. None of them realise that Tom is hiding a secret. On the surface, his move to Fairweather was to escape his highflying life in London and to put some much-needed distance between him and his ex-fiancee - but deep down Tom knows that there are some things he cannot run from. As the months pass with book club gatherings, secrets are shared and hurts begin to heal. New friendships might be the last thing on their minds but the members of the book club are about to discover that opening themselves up to other people might be the only thing that will help them all to live, and to love, again. This long-sleeve, flannel pyjama set brings brushed cotton warmth to your cold-weather nights. includes top and pants washed for extra softness & reduced shrinkage notch collar long sleeves elastic waist with drawstring 100% cotton washable imported", "price": "12.60", "rating": "4.34", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51aWCtd+fzL._SX325_BO1,204,203,200_.jpg", "image": "51aWCtd+fzL._SX325_BO1,204,203,200_.jpg"}}, {"model": "products.product", "pk": 94, "fields": {"category": 10, "sku": "pp5005940242", "name": "Other Women", "author": "Cathy Kelly", "description": "Three women. Three secrets. Three tangled lives...  Sid wears her independence like armour. So when she strikes up a rare connection with unlucky-in-love Finn, they are both determined to prove that men and women can just be friends. Can't they? Marin has the perfect home, attentive husband, two beloved children - and a secret addiction to designer clothes. She knows she has it all, so why can't she stop comparing herself to other women? Bea believes that we all have one love story - and she's had hers. Now her life centres around her son, Luke, and her support group of fierce single women. But there's something that she can't tell anyone...", "price": "21.99", "rating": "4.03", "image_url": "https://images-na.ssl-images-amazon.com/images/I/41esA6PrKnL._SX307_BO1,204,203,200_.jpg", "image": "41esA6PrKnL._SX307_BO1,204,203,200_.jpg"}}, {"model": "products.product", "pk": 95, "fields": {"category": 10, "sku": "pp5005940299", "name": "Breaking Point", "author": "Edel Coffey", "description": "An innocent mistake. A lifetime of guilt. Susannah has two beautiful daughters, a high-flying medical career, a successful husband, and an enviable life. Her hair is glossy, her clothes are expensive; she truly has it all. But when - on the hottest day of the year - her strict morning routine is disrupted, Susannah finds herself running on autopilot. It is hours before she realizes she has made a devastating mistake. Her baby, Louise, is still in the backseat of the car and it is too late to save her. As the press closes in around her, Susannah is put on trial for negligence. It is plain to see that this is not a trial, it's a witch hunt. But what will the court say? ", "price": "19.60", "rating": "4.08", "image_url": null, "image": "Breaking Point.jpg"}}, {"model": "products.product", "pk": 96, "fields": {"category": 10, "sku": "pp5005941612", "name": "Beautiful World, Where Are You", "author": "Sally Rooney", "description": "Alice, a novelist, meets Felix, who works in a warehouse, and asks him if he'd like to travel to Rome with her. In Dublin, her best friend, Eileen, is getting over a break-up and slips back into flirting with Simon, a man she has known since childhood. Alice, Felix, Eileen, and Simon are still young—but life is catching up with them. They desire each other, they delude each other, they get together, they break apart. They have sex, they worry about sex, they worry about their friendships and the world they live in. Are they standing in the last lighted room before the darkness, bearing witness to something? Will they find a way to believe in a beautiful world?", "price": "19.60", "rating": "3.64", "image_url": "https://images-na.ssl-images-amazon.com/images/I/41RfHWoMEQS._SX308_BO1,204,203,200_.jpg", "image": "41RfHWoMEQS._SX308_BO1,204,203,200_.jpg"}}, {"model": "products.product", "pk": 97, "fields": {"category": 10, "sku": "pp5005980058", "name": "The Letter Home", "author": "Rachael English", "description": "A rich, heartbreaking novel, moving between west of Ireland and Boston, of a mother's love, a baby girl, a courageous voyage, and a forgotten story that binds two families separated by an ocean... She had left behind everything she loved to forge a future for the one she treasured most... 2019 Dublin. When Jessie Daly loses her job, her flat and her relationship, she travels home to Ireland's west coast and helps an old friend researching what happened in the area during the 1840s Famine. They are drawn into the remarkable story of a brave young mother called Bridget Moloney, and Jessie becomes determined to find out what happened to Bridget and her daughter, Norah. On the other side of the Atlantic, Kaitlin Wilson is researching her family tree. She knows her ancestors left Ireland for Boston in the 19th century. Everything else is a mystery. Kaitlin unearths a fascinating story, but her research forces her to confront uncomfortable truths about herself and her family and also uncover a heartbreaking connection to a young woman in the west of Ireland... ", "price": "19.60", "rating": "4.35", "image_url": null, "image": "The Letter Home.jpg"}}, {"model": "products.product", "pk": 98, "fields": {"category": 10, "sku": "pp5005980146", "name": "Aisling and the City", "author": "Emer McLysaght", "description": "Aisling is 31, and she's still a complete Aisling. With BallyGoBrunch flying and the door firmly closed on her relationship with John, Aisling accepts an unexpected job offer and boards a business-class flight to New York in her best wrap dress and heels. As she finds her feet in the Big Apple, she throws herself into the dating game, grapples with 'always-on' work culture, forges and fights for new friendships and brings her good wedges to a party in the Hamptons, much to Sadhbh's dismay. But catching up with family and friends on WhatsApp and email is not the same as sitting in Maguire's putting the world to rights over mini bottles of Pinot Greej and a shared bag of Taytos. And yet New York has so much to offer, not least in the ridey fireman department. ", "price": "14.99", "rating": "4.09", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81sMSNqhUkL.jpg", "image": "81sMSNqhUkL.jpg"}}, {"model": "products.product", "pk": 99, "fields": {"category": 10, "sku": "pp5006070077", "name": "Freckles", "author": "Cecelia Ahern", "description": "The brand new novel from million-copy bestselling author Cecelia Ahern. You are the average of the five people you spend the most time with. When a stranger utters these words to Allegra Bird, nicknamed Freckles, it turns her highly ordered life upside down. In her current life as a parking warden, she has left her eccentric father and unconventional childhood behind for a bold new life in the city. But a single encounter leads her to ask the question she's been avoiding for so long:  who are the people who made her the way she is? And who are the five people who can shape and determine her future? Just as she once joined the freckles on her skin to mirror the constellations in the night sky, she must once again look for connections.Told in Allegra's vivid, original voice, moving from Dublin to the fierce Atlantic coast, this is an unforgettable story of human connection, of friendship, and growing into your own skin. Five people. Five stars. Freckle to freckle. Star to star.", "price": "18.20", "rating": "3.76", "image_url": "hhttps://kbimages1-a.akamaihd.net/a74cca92-be96-429e-9392-cacfc25c0ef2/1200/1200/False/freckles-46.jpg", "image": "freckles-46.jpg"}}, {"model": "products.product", "pk": 100, "fields": {"category": 11, "sku": "pp5006081758", "name": "Jump", "author": "Daniella Moyles", "description": "'The point of all this has nothing to do with finding yourself. It's about what you can do to lose what you don't need.' It's a dark rainy afternoon on Dublin's jammed M50 motorway. The rain is hammering on the windscreen of Daniella Moyles' car. She is 26, a highly successful radio presenter, model and influencer, but panic is building in her head and chest, the internal state of affairs she has been trying to ignore finally spilling over into something undeniably physical. She is frozen, petrified, looks at her boyfriend and says, 'I don't know who or where I am.' This day changed Daniella's life. It derailed almost everything she had worked to achieve and set her on a new path. Jump is the story of what happened when Daniella quit her job to backpack around the world for two years, and how freedom from the trappings of what society considers success leads to true contentment, strength and authenticity.  ", "price": "17.99", "rating": "4.80", "image_url": null, "image": "Jump.jpg"}}, {"model": "products.product", "pk": 101, "fields": {"category": 11, "sku": "pp5006082011", "name": "The Women Who Ran Away", "author": "Sheila O'Flanagan", "description": "Deira is setting out on the holiday she'd planned with her long-term partner Gavin... only she's on her own. Gavin will not be amused when he finds out she 'borrowed' his car, but since their brutal break-up Deira's not been acting rationally. Maybe a drive through beautiful France will help her see things differently... Grace is also travelling alone, each stage of her journey outlined in advance by her late husband. Ken was head of the household when he was alive, and it seems he's still in charge. His last decision was a surprise - could there be more surprises to come? There's only one way to find out, galling though it is to dance again to Ken's tune... Thrown together by chance, Deira and Grace are soon motoring down the French highways, sharing intriguing stories of their pasts, as they each consider the future... ", "price": "12.60", "rating": "3.96", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81B6bmppTAL.jpg", "image": "81B6bmppTAL.jpg"}}, {"model": "products.product", "pk": 102, "fields": {"category": 11, "sku": "pp5006150186", "name": "Falling", "author": "T.J. Newman", "description": "You just boarded a flight to New York. There are one hundred and forty-three other passengers onboard. What you don't know is that thirty minutes before the flight your pilot's family was kidnapped. For his family to live, everyone on your plane must die. The only way the family will survive is if the pilot follows his orders and crashes the plane. Enjoy the flight.", "price": "18.20", "rating": "3.89", "image_url": "https://d28hgpri8am2if.cloudfront.net/book_images/onix/cvr9781398507241/falling-9781398507241_hr.jpg", "image": "falling-9781398507241_hr.jpg"}}, {"model": "products.product", "pk": 103, "fields": {"category": 11, "sku": "pp5006153172", "name": "Why We Swim", "author": "Bonnie Tsui", "description": "'A jewel of a book, a paean to the wonders of water and our place within it' James Nestor, best selling of author of Breath ' Glorious' The New York Times Take a dive into the deep and discover what it is about water that seduces us, heals us and brings us together. Join writer and swimming Bonnie Tsui as she explores the unique skill of swimming from the five angles of survival, wellbeing, community, competition and flow. Propelled by stories of polar swim champions, a Baghdad swim club, Olympic athletes and modern-day samurai swimmers, Why We Swim takes us around the globe in a remarkable, all-encompassing account of the world of swimming. This is a joyous meditation on our innate connection to water and a true celebration of the wonders of swimming.", "price": "14.00", "rating": "3.98", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71dX-JtV0qL.jpg", "image": "71dX-JtV0qL.jpg"}}, {"model": "products.product", "pk": 104, "fields": {"category": 11, "sku": "pp5006160127", "name": "You Had Me At Halloumi", "author": "Ginger Jones", "description": "Freya Butterly has always dreamt of being a Head Chef but despite running every service at the Mediterranean restaurant, she still doesn't get the recognition she deserves. Craving adventure and a real taste of the Mediterranean, Freya takes matters into her own hands, ditching both her job and unsympathetic boyfriend and packing her bags for sunny Cyprus in pursuit of the prestigious Golden Spoon culinary award. As one of the seven competitors, Freya is determined to rediscover her passion for food and clinch the prize, but what she doesn't expect to discover is Xanthos. As gorgeous as he is charming - he's quite the dish - and Freya is instantly attracted to him, but this trip was about Cypriot cuisine, not romance and she knows she must not let Xanthos distract her from the competition. But if she walks away, will Freya spend the rest of her life wondering What If? Surely, it's feta late than never . . .", "price": "12.59", "rating": "4.23", "image_url": "https://images-na.ssl-images-amazon.com/images/I/612pABPz9zL.jpg", "image": "612pABPz9zL.jpg"}}, {"model": "products.product", "pk": 105, "fields": {"category": 11, "sku": "pp5006160833", "name": "If You Were There: Missing People and the Marks They Leave Behind", "author": "Francisco García", "description": "A powerful, evocative and deeply personal journey into the world of missing people When Francisco Garcia was just seven years old, his father, Christobal, left his family. Unemployed, addicted to drink and drugs, and adrift in life, Christobal decided he would rather disappear altogether than carry on dealing with the problems in front of him. So that's what he did, leaving his young wife and child in the dead of night. He has been missing ever since. Twenty years on, Francisco is ready to take up the search for answers. Why did this happen and how could it be possible? Where might his father have gone? And is there any reason to hope for a happy reunion? During his journey, which takes him all across Britain and back to his father's homeland of Spain, Francisco tells the stories of those he meets along the way: the police investigators; the charity employees and volunteers; the once missing and those perilously at risk around us; the families, friends and all those left behind. If You Were There is the moving and affecting story of one man's search for his lost family, an urgent document of where we are now and a powerful, timeless reminder of our responsibility to others.", "price": "13.99", "rating": "3.85", "image_url": "https://cdn.waterstones.com/override/v1/large/9780/0084/9780008412159.jpg", "image": "9780008412159.jpg"}}, {"model": "products.product", "pk": 106, "fields": {"category": 11, "sku": "pp5006170128", "name": "The Way of the Gardener: Lost in the Weeds Along the Camino de Santiago", "author": "Lyndon Penner", "description": "Reverence takes on a new meaning in this original memoir of an avid gardener walking the Camino de Santiago. The Camino de Santiago has been a journey for pilgrims for more than 1,000 years, testing to varying degrees their spirit, faith, and physical endurance. Lyndon Penner's attention lies elsewhere. A renowned gardener and lover of literature, he revels in the plants, trees, and flowers that tell the history of the people and ecology of northern Spain. Brimming with wry observations of nature, himself, and other pilgrims on the road The Way of the Gardener reveals the beauty and the darkness of the human condition while underscoring the deeply fascinating nature of nature itself. This textured work makes for perfect armchair or garden reading.", "price": "27.99", "rating": "4.14", "image_url": "https://uofrpress.ca/var/site/storage/images/books/t/the-way-of-the-gardener/9780889778061_cover/437201-1-eng-CA/9780889778061_cover1_rb_modalcover.jpg", "image": "9780889778061_cover1_rb_modalcover.jpg"}}, {"model": "products.product", "pk": 107, "fields": {"category": 11, "sku": "pp5006170131", "name": "Kobe Bryant: A Tribute to a Basketball Legend", "author": "Sports Illustrated", "description": "In 20 seasons in a Los Angeles Lakers uniform, Kobe Bryant ascended from teenaged rookie to 18-time all-star and five-time NBA champion. The superstar known as The Black Mamba left his mark on basketball and popular culture as a fierce competitor who inspired those around him and never settled for less than the best. These moments and memories are collected in Kobe Bryant: A Tribute to the Basketball Legend, a fully illustrated commemorative book celebrating Bryant's life and career. Featuring more than 100 photographs and written coverage from the pages of Sports Illustrated, this new volume provides readers a complete portrait of the international basketball superstar who transcended his sport to become a cultural icon. Relive every moment including the 1997 NBA Slam Dunk Contest in 1997, consecutive NBA Finals MVP awards in 2009 and 2010, the unforgettable 60-point farewell game, and the poignant tributes that followed Bryant's shocking death alongside his 13-year-old daughter Gianna and seven others in a 2020 helicopter crash.", "price": "21.99", "rating": "4.68", "image_url": "https://images-na.ssl-images-amazon.com/images/I/A1z7ywkr2wL.jpg", "image": "A1z7ywkr2wL.jpg"}}, {"model": "products.product", "pk": 108, "fields": {"category": 11, "sku": "pp5006170357", "name": "The Historic Heart of Oxford University", "author": "Geoffrey Tyack", "description": "An accessible guide to Oxford's world-famous architectural heritage. Over eight centuries, the University of Oxford the third oldest university in Europe gradually came to occupy a substantial portion of the city, creating in the process a unique townscape containing the Bodleian Library, the Sheldonian Theatre, and the Radcliffe Camera. This book tells the story of the growth of the forum universitatis, as the architect Nicholas Hawksmoor called it, and relates it to the broader history of the University and the city. Based on up-to-date scholarship, The Historic Heart of Oxford University draws upon the author's research into Oxford's architectural history and the work of Christopher Wren, Nicholas Hawksmoor, James Gibbs, and Giles Gilbert Scott. Each of the eight chapters focuses on the gestation, creation, and subsequent history of a single building or pair of buildings, relating them to developments in the University's intellectual and institutional life, and to broader themes in architectural and urban history. Accessible and well-illustrated with plans, archival prints, and specially commissioned photography, this book will appeal to anyone who wishes to understand and enjoy Oxford's matchless architectural heritage.", "price": "49.00", "rating": "3.70", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51YAQ-4BzTS._SX414_BO1,204,203,200_.jpg", "image": "51YAQ-4BzTS._SX414_BO1,204,203,200_.jpg"}}, {"model": "products.product", "pk": 109, "fields": {"category": 11, "sku": "pp5006200155", "name": "Marram", "author": "Leonie Charlton", "description": "From the southern tip of Barra to the ancient stone circle of Callanish, Leonie and her friend Shuna ride off the beaten tracks on their beloved Highland ponies, Ross and Chief. In deeply poetic prose, she describes not only the beauties of the Hebridean landscape, its spare, penetrating light and its people, but also confronts the ghost of her mother and their deeply fractured relationship.", "price": "29.99", "rating": "4.18", "image_url": "https://images-na.ssl-images-amazon.com/images/I/81TCaEoIggL.jpg", "image": "81TCaEoIggL.jpg"}}, {"model": "products.product", "pk": 110, "fields": {"category": 12, "sku": "pp5006200658", "name": "The Murder of Mr Moonlight", "author": "Catherine Fegan", "description": "Bobby Ryan's disappearance in rural Tipperary in June 2011 mystified all who knew him. The truck-driver and part-time DJ (known as Mr Moonlight) was an easy-going fellow with no enemies. Or so everyone thought. When Ryan's body was found 22 months later on the farm of Mary Lowry, the wealthy young widow he had been seeing, it was clear that he had met a violent end. And the most likely person to have brought about that end? Pat Quirke, the man who had 'discovered' the body - Mary Lowry's brother-in-law, financial advisor, tenant and one-time lover. Following the longest running murder trial in Irish criminal history Quirke was convicted of murder in May 2019. Getting to that day had taken years of exhaustive work by gardai. The Murder of Mr Moonlight is the definitive account of their investigation as well as the compelling story of how an innocent man paid the price for another man's obsessions. Catherine Fegan, Irish Journalist of the Year (2017), and Chief Correspondent at the Irish Daily Mail, covered every day of Quirke's trial. Over many months she also conducted interviews in Tipperary and further afield. She has written an extraordinary insightful and meticulous account of the case that gripped the nation.", "price": "12.60", "rating": "4.28", "image_url": "https://images-eu.ssl-images-amazon.com/images/I/511XPTyoKGL._SX342_SY445_QL70_ML2_.jpg", "image": "511XPTyoKGL._SX342_SY445_QL70_ML2_.jpg"}}, {"model": "products.product", "pk": 111, "fields": {"category": 12, "sku": "pp5006241766", "name": "Murder At Roaringwater", "author": "Nick Foster", "description": "The inside story of the death of Sophie Toscan du Plantier. This is a violent, unresolved murder, where the victim seemed to have a premonition of her own terrible end. For six years, Nick Foster has been piecing together the life and death of Sophie, who was brutally killed outside her cottage in rural West Cork in 1996. He also developed an ongoing 'friendship' with the Englishman long-suspected of her murder, Ian Bailey, and his partner, Jules, the couple at the centre of the case. This story is as fascinating as it is tragic. It follows Nick in Paris and Ireland during his dedicated investigation into the circumstances surrounding Sophie's murder, his quest to reveal her killer and efforts to understand what the motive could have been for such a terrible crime.", "price": "18.20", "rating": "4.09", "image_url": "https://m.media-amazon.com/images/I/41JT2JvztHS.jpg", "image": "41JT2JvztHS.jpg"}}, {"model": "products.product", "pk": 112, "fields": {"category": 12, "sku": "pp5006242155", "name": "Crowded House", "author": "Frank Greaney", "description": "In June 2017, a woman out picnicking in the Wicklow Mountains stumbled upon something in a ditch that would set in motion a chain of events that horrified the nation. It was the first of fifteen dismembered body parts belonging to retired hospital worker Patricia O'Connor. Kieran Greene, the father of three of Patricia's grandchildren, later handed himself in, confessing to beating her to death in the home they shared in what he said was an act of self-defence. He also confessed to dismembering her and disposing of her remains but later changed his story, implicating several members of Patricia's household, including her husband and daughter. In this nuanced and meticulous account of a deeply disturbing crime, journalist Frank Greaney, who covered every day of the shocking trial and conducted exclusive follow-up interviews with other members of Patricia's family, uncovers the story behind the gruesome murder of Patricia O'Connor, and looks at who Patricia really was. ", "price": "19.99", "rating": "4.18", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51LHSZeRyOL._SX342_SY445_QL70_ML2_.jpg", "image": "v51LHSZeRyOL._SX342_SY445_QL70_ML2_.jpg"}}, {"model": "products.product", "pk": 113, "fields": {"category": 12, "sku": "pp5006242904", "name": "Death on Ireland's Eye", "author": "Dean Ruxton", "description": "A tragic death, a murder trial and a 170-year-old mystery but what really happened? Shortly after Maria Kirwan died in a lonely inlet on Ireland's Eye, it was decided that she had drowned accidentally during a day spent with her husband on the picturesque island. This inquest verdict appeared to conclude the melancholy events that consumed the fishing village of Howth, Co Dublin, in September 1852. But not long afterwards, suspicion fell upon Maria's husband, William Burke Kirwan, as whispers of unspeakable cruelty, an evil character and a secret life rattled through the streets of Dublin. Investigations led to William's arrest and trial for murder. The story swelled into one of the most bitterly divisive chapters in the dark annals of Irish criminal history. Yet questions remain: Does the evidence stand up? What role did the heavy hand of Victorian moral outrage play? Was William really guilty of murder, or did the ever-present 'moral facts' fill in gaps where hard proof was absent? Now, this compelling modern analysis revisits the key evidence, asking sober questions about the facts, half-facts and fantasies buried within the yellowed pages of the Ireland's Eye case files.", "price": "16.99", "rating": "3.20", "image_url": "https://pbs.twimg.com/media/FLok7teX0AIHW_E.jpg", "image": "FLok7teX0AIHW_E.jpg"}}, {"model": "products.product", "pk": 114, "fields": {"category": 12, "sku": "pp5006242905", "name": "A Dream of Death", "author": "Ralph Riegel", "description": "'It was French film-maker Sophie Toscan du Plantier's dream to have a holiday home in beautiful Schull in west Cork. But on 23 December 1996, she was brutally murdered outside that holiday home, the poetry book she had been reading chillingly left open on a page occupied by the Yeats poem 'A Dream of Death'. For 23 years the story of her murder has not left the headlines, the victim overshadowed by Ian Bailey, the main suspect in the case, who has consistently maintained his innocence and claimed attempts were made to frame him for the crime, but who was the focus of a historic trial in absentia in Paris in 2019. Here, in the definitive account of what became Ireland's most notorious unsolved crime, Ralph Riegel delves into the facts and theories of the unsolved murder that caused such shock waves in Sophie's native France and in the quiet Cork countryside she had chosen as her retreat.   ", "price": "24.99", "rating": "3.97", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71PxBbYJIiL.jpg", "image": "71PxBbYJIiL.jpg"}}, {"model": "products.product", "pk": 115, "fields": {"category": 12, "sku": "pp5006243106", "name": "The Hitmen: The Shocking True Story of a Family of Killers for Hire", "author": "Stephen Breen", "description": "Brothers Eric, Keith and John Wilson, their cousin Alan, and nephew Luke shared a trade - assassination. Working for Ireland's criminal gangs they brought bloodshed and chaos to the streets. The Wilsons were not choosy about their targets. Hutches, Real IRA chiefs or random opponents from pub rows - they were all the same to them. Nor were they picky about motives - as long as the price was right, they asked no questions. The Hitmen is the shocking story of how a family cornered the market in intimidation and vengeance. It details the terrible cost in human suffering, particularly the death of an innocent teenage girl, Mariaora Rostas, when she randomly crossed their path. And it reveals how, one by one, each of the Wilsons was put out of business. The Hitmen draws on exclusive access to wiretaps, case files and interviews with sources close to the gang who have never spoken before. No 1 bestselling authors Stephen Breen and Owen Conlon have written an extraordinary account of a family business like no other.", "price": "28.99", "rating": "3.93", "image_url": "https://m.media-amazon.com/images/I/513Xc3Jh2yS.jpg", "image": "513Xc3Jh2yS.jpg"}}, {"model": "products.product", "pk": 116, "fields": {"category": 12, "sku": "pp5006243276", "name": "Clash of the Clans: The rise of the Irish narcos and boxing's dirty secrets", "author": "Nicola Tallant", "description": "CLASH OF THE CLANS is a story that traces the emergence of the Irish mafia from the streets of Dublin to the highest echelons of global organised crime and right into the heart of professional boxing. When a weigh-in turns into a gangland bloodbath, the tables begin to turn on the powerful Kinahan Organised Crime Group. But is it too late to tame the beast or can the law finally catch up with the mob? Bestselling author and award-winning crime journalist Nicola Tallant brings the reader on her own journey of discovery as she delves into the dangerous underworld where a golden era of cocaine turned a brat pack of street dealers into an international mafia.With a unique insight into the rise of mob and its reach into boxing through a tapestry of confidential informants and some too-close-for-comfort experiences, Tallant brings to life one of the most extraordinary stories in modern organised crime. Following the trail from the local authority estates of the Irish capital to the gilded mansions of Dubai, Clash of the Clans: The Rise of the Irish Narcos and Boxing's Dirty Secret powers through the intriguing tale of the cocaine cowboys and the rivalries that threaten to bring down an empire.", "price": "21.00", "rating": "4.40", "image_url": "https://www.dubraybooks.ie/images/thumbs/084/0844995_9781913406653_625.jpeg", "image": "0844995_9781913406653_625.jpeg"}}, {"model": "products.product", "pk": 117, "fields": {"category": 12, "sku": "pp5006280064", "name": "Clarks Lexi Alloy Slide Strap Sandals", "author": "Pat Marry", "description": "But as a newly qualified garda in 1985, Marry had no idea how to become a detective. He soon realised he would have to learn on the job - put himself forward and show that he had what it took. Taking initiative, following up hunches (even far-fetched ones), obsessing about details, trying new investigative techniques, thinking laterally - these were essential. In addition, you had to be a bit of a psychologist. The Making of a Detective follows Pat Marry's path from rookie to Detective Inspector through the stories of key cases he worked on and investigations he led. It includes high profile cases like Rachel Calally's murder by her husband Joe O'Reilly. But there are also stories that have faded from public memory, such as the 1995 murder of Marilyn Rynn, which involved the first use of DNA evidence to solve a crime in Ireland. Or the 2001 murder of Mary Gough, a case solved mainly by scrutinizing her husband's internet use - then a new investigative tool. The Making of a Detective is a unique and gripping insight into the work of a dedicated garda operating at the very top of his profession.", "price": "14.00", "rating": "4.38", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51XlyuoGukL._SX325_BO1,204,203,200_.jpg", "image": "51XlyuoGukL._SX325_BO1,204,203,200_.jpg"}}, {"model": "products.product", "pk": 118, "fields": {"category": 12, "sku": "pp5006280190", "name": "Almost the Perfect Murder", "author": "Paul Williams", "description": "For over a year everyone assumed missing Dublin woman Elaine O'Hara had ended her own life. But after her remains were found gardai discovered that Elaine was in thrall to a man who had spent years grooming her to let him kill her. That man was Graham Dwyer, a married father of three and partner in a Dublin architecture practice. Almost the Perfect Murder details the exhaustive investigation - one of the most complex and chilling in Irish criminal justice history - that allowed gardai to build a case against Dwyer. And it outlines the twists and turns - both in the courtroom and behind the scenes - during the dramatic trial that followed.This book includes fresh insights into the garda investigation and background information on Graham Dwyer.", "price": "12.60", "rating": "4.14", "image_url": "https://m.media-amazon.com/images/I/51WctOMfQ0L.jpg", "image": "51WctOMfQ0L.jpg"}}, {"model": "products.product", "pk": 119, "fields": {"category": 12, "sku": "pp5006291997", "name": "My Brother Jason", "author": "Tracey Corbett-Lynch", "description": "In August 2014 Limerick man Jason Corbett was murdered by his wife, Molly Martens, and her father, ex-FBI agent Tom Martens, in the bedroom of their luxury North Carolina home. He had been savagely beaten to death with a baseball bat and brick while his children slept nearby. For his sister, Tracey Corbett-Lynch, and the rest of his family in Ireland it was just the beginning of the nightmare that would involve a custody battle for his orphaned children, an online hate campaign by Molly Martens and, ultimately, the gripping trial that would lead to her conviction, alongside her father, for his murder. My Brother Jason is the story of how this seemingly all-American girl from a picture-perfect family targeted the widowed Jason Corbett, becoming nanny to his children in a desperate bid to create the family and security she craved, thus setting in motion a series of events that would lead to Jason's brutal killing by the woman he had once loved. Here, for the first time, Tracey Corbett-Lynch tells her family's side of the story in a book that contains shocking revelations about Molly Marten's history of strange behaviour and the lengths she was willing to go to in order to get custody of Jason's children. With full access to Jason's letters, emails, keepsakes and photographs, it is the story of how an ordinary, loving family was torn apart by the brutal murder of their beloved brother.", "price": "9.99", "rating": "4.40", "image_url": "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/7171/9780717181285.jpg", "image": "9780717181285.jpg"}}, {"model": "products.product", "pk": 120, "fields": {"category": 13, "sku": "pp5006310072", "name": "The Happy Pear: Vegan Cooking for Everyone", "author": "David Flynn", "description": "If you have decided you want to be vegan, where do you start? Or if you are an experienced cook how do you make plant-based meals that are delicious and full of variety? And if you are already vegan but looking for inspiration are there simple principles to help you come up with your own dishes? Ask no more - The Happy Pear: Vegan Cooking for Everyone has the answers. After twenty years of plant-based cooking, bestselling chefs Dave and Steve Flynn have developed an encyclopaedic knowledge of how it works and how to make vegan food simple, creative and totally irresistible. Dave and Steve's new book distils all their knowledge into ten chapters that are full of master recipes, step-by-step guides, fun variations and top tips, and an approach to plant-based eating that will inspire you to become the best cook of vegan food you can possibly be.", "price": "28.00", "rating": "5.00", "image_url": "https://www.easons.com/globalassets/5637150827/all/books/lifestyle-hobbies-and-leisure/cookery--food-and-drink/vegetarian-cookingand-vegetarianism/97818448848722.jpg", "image": "97818448848722.jpg"}}, {"model": "products.product", "pk": 121, "fields": {"category": 13, "sku": "pp5006310446", "name": "The Daly Dish Rides Again", "author": "Gina Daly", "description": "Instagram sensations and debut cookbook authors Gina and Karol Daly had a massive hit in 2020 with their first cookbook, The Daly Dish. Now they are back with more food that looks so decadent, you will find it hard to believe it will help you to achieve your slimming goals. Just ask Gina and Karol - between them they have lost over 10 stone and feel better than ever! Compatible with the principles of many popular diet programmes, you will find fan favourites such as Tasty Tacos, No Stress Stew and Perfect Pizza. The Daly Dish Rides Again will have you looking forward to dinner every night and looking forward to weighing in on the scales too!", "price": "22.99", "rating": "4.40", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51+3f92XfKL._SX389_BO1,204,203,200_.jpg", "image": "51+3f92XfKL._SX389_BO1,204,203,200_.jpg"}}, {"model": "products.product", "pk": 122, "fields": {"category": 13, "sku": "pp5006310918", "name": "The Daly Dish Diary", "author": "Gina Daly", "description": "Get your weight loss goals on track with this inspirational planner from the people who brought you the phenomenal cookbook, The Daly Dish. This stylish food diary will allow you to chart your weekly progress as you log details of your meals and weight, alongside motivational quotes, new recipes and cooking tips from a pair who know what they're talking about, having lost almost 10 stone between them. Full of practical advice for setting targets, maintaining focus and achieving results, this handbag-friendly planner will help you stay on course to a healthier you.", "price": "14.39", "rating": "4.60", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1601939198l/55115995.jpg", "image": "55115995.jpg"}}, {"model": "products.product", "pk": 123, "fields": {"category": 13, "sku": "pp5006310935", "name": "Clodagh's Weeknight Kitchen", "author": "Clodagh McKenna", "description": "Clodagh's 100 interesting, simple recipes from meat-free meals to quick-fix dishes and cupboard suppers offer the answers to all your weeknight dinner dilemmas. With her trademark twists, Clodagh's inspirational but achievable dishes elevate the simple to something special.", "price": "28.00", "rating": "4.40", "image_url": "https://images-na.ssl-images-amazon.com/images/I/51V48QHjehL.jpg", "image": "51V48QHjehL.jpg"}}, {"model": "products.product", "pk": 124, "fields": {"category": 13, "sku": "pp5006311067", "name": "THE JOY OF FOOD H/B", "author": "Rory O'Connell", "description": "This is the book Rory O'Connell was born to write. Not only a collection of good things to eat, showcasing the best of Irish seasonal produce from Rustic Chicken, Swiss Chard and Tarragon Tart to Blackberry and Sweet Geranium Posset, The Joy of Food is also a celebration of everything Rory is passionate about: first-rate ingredients, simple and respectful cooking techniques and the absolute pleasure that comes from enjoying and sharing the result. Accompanying the recipes are Rory's charming original illustrations and personal essays in praise of everything from hazelnuts to the humble hen.", "price": "27.99", "rating": "4.80", "image_url": "https://images-na.ssl-images-amazon.com/images/I/716E3lVux4L.jpg", "image": "716E3lVux4L.jpg"}}, {"model": "products.product", "pk": 125, "fields": {"category": 13, "sku": "pp5006330197", "name": "TRISHA'S TRANSFORMATION", "author": "Trisha Lewis", "description": "Chef  Trisha Lewis was days away from her 30th birthday when she set herself the goal of losing over half her body weight. She weighed 27 stone and was often mocked for her size. Now, through sheer determination, she has overhauled her life giving up smoking, joining a gym and transforming her diet. Trisha has documented her journey on Instagram, gaining over 90,000 followers Trisha's Transformers who are inspired by her relatability, can-do attitude, honesty and openness about the highs and lows of her weight-loss journey.", "price": "19.99", "rating": "4.50", "image_url": "https://images-na.ssl-images-amazon.com/images/I/61lAnSnVPIL.jpg", "image": "61lAnSnVPIL.jpg"}}, {"model": "products.product", "pk": 126, "fields": {"category": 13, "sku": "pp5006330208", "name": "Neven Maguire's Midweek Meals", "author": "Neven Maguire", "description": "Even if you like to cook, getting dinner on the table Monday to Friday can be a daily drag. But not any longer! Neven Maguire's fantastic new book will inspire you to create real, fast and delicious family food all ready to eat in jig time. Chapters include 'Low and Slow' for when you have time to plan ahead, 'Cupboard's Bare' for when you don't; 'One-Pan Dinners' for quick and easy soups and stir fries and 'Supermarket Sweep' for when you can pick up an ingredient or two on your way home. This family-friendly, modern cookbook is packed with easy, everyday dinners to inspire you Monday to Friday!", "price": "22.99", "rating": "5.00", "image_url": "https://images-na.ssl-images-amazon.com/images/I/71iTuOBskTL.jpg", "image": "1iTuOBskTL.jpg"}}, {"model": "products.product", "pk": 127, "fields": {"category": 13, "sku": "pp5006333711", "name": "The Veg Box: 10 Vegetables, 10 Ways", "author": "David Flynn, Stephen Flynn", "description": "David and Stephen Flynn, a.k.a the Happy Pear twins, are back with their simplest cookbook yet! The perfect collection for vegans, vegetarians, or anyone looking to eat more plant-based recipes - pre-order your copy now. AUBERGINE - BEETROOT - BROCCOLI - CABBAGE - CARROT - CAULIFLOWER - COURGETTE - LEEK - MUSHROOMS - POTATOES Ten vegetables, ten ways, The Veg Box makes cooking veg easier and tastier than ever before! This vibrant book is packed with over 100 new recipes that use just ten ingredients or less and showcase the delicious and diverse ways you can enjoy each vegetable. Take carrots for example. Learn how to transform this simple produce into: Carrot and Sesame Burgers Roasted Carrot Tagine Chewy Flapjacks with Carrot and Pistachio Or how about courgettes? Watch them become: Easy One-Pan Courgette Pizza Courgette Crepes with Spinach and Ricotta Courgette and Lemon Loaf Cake with a Lemon Curd Building tips on eating more sustainably into family-friendly meals, quick weeknight dinners and sweet treats, this is healthy eating for our planet, our bodies and our taste buds. PRAISE FOR THE HAPPY PEAR 'These lovely boys always create incredibly tasty food' Jamie Oliver 'The poster boys for a healthy way of life!' Sunday Times 'A healthy-eating phenomenon' Mail on Sunday 'Great people, unbelievable food' Joe Wicks", "price": "21.99", "rating": "5.00", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1647259812l/59063650.jpg", "image": "59063650.jpg"}}, {"model": "products.product", "pk": 128, "fields": {"category": 13, "sku": "pp5006340653", "name": "Soup Broth Bread", "author": " Rachel Allen", "description": "Buy Soup Broth Bread today to discover Rachel Allen's timeless collection of recipes for soups, breads, garnishes, stocks and more. In this love-letter to the world's most ubiquitous dish, acclaimed TV chef, cookery writer and renowned teacher, Rachel Allen, explores everything soup has to offer. Whether as a starter or main dish, a quick fix or a leisurely indulgence, to nourish a cold or heal a broken heart, or to feed yourself, your family or a crowd of friends, there is a soup for every occasion. With Rachel's guidance you can learn the classics and then expand your horizons, with delicious, achievable, heart-warming recipes you'll turn to time and time again. Recipes include: - French onion soup with gruyere toasts - Roasted tomato and basil soup - Japanese chicken and udon noodle broth - Soupe au pistou - Watermelon gazpacho - Game broth with lentils, garlic and parsley - West African peanut soup Rachel also shares easy recipes for fresh homemade breads, as well as clever garnishes, essential stocks, and a wealth of tips on equipment, batch-cooking, freezing, and presentation. Just as every cook needs good soup in their repertoire, this book will be a must-have source of inspiration for every kitchen shelf.", "price": "28.00", "rating": "5.00", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1636978596l/56776793.jpg", "image": "56776793.jpg"}}, {"model": "products.product", "pk": 129, "fields": {"category": 13, "sku": "pp5006370013", "name": "Everyday Cook", "author": "Donal Skehan", "description": "In Donal's 10th cookbook he offers a collection of simplified and doable classic recipes to help you reclaim your kitchen without sacrificing time or flavour. Veg-packed food has never looked this good! With 15/30 minute meals, one pot wonders, meals to prep ahead, easy dinner favourites, recipes to batch cook and freeze, and dessert classics, these recipes will help you to manage life and all its twists and turns, while still managing to pull together meals that are nourishing, vibrant and delicious. Recipes feature Crispy Duck Hoisin Lettuce Wraps, Oven Roasted Ratatouille, Roast Cherry Tomato Pici with Basil & Buratta, Crispy Egg Fried Rice Bowls, Smokey Fish Pie with Velvet Mash, No Cook Lemon Cream Pie and Boozy Brownie Meringue Cake - there's something for everyone. Armed with meal planner suggestions and Donal's helpful cooks notes, you'll find a helpful routine, ways to make your kitchen work for you and a range of recipes to bring ease, flavour and speed to your everyday cooking.", "price": "35.00", "rating": "4.30", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1623119872l/56624971.jpg", "image": "56624971.jpg"}}, {"model": "products.product", "pk": 130, "fields": {"category": 14, "sku": "pp5006380233", "name": "Blind Spot", "author": "Paula Hawkins", "description": "Since they were kids, Edie, Jake and Ryan have been the closest of friends. It's been the three of them against the world. Edie thought the bonds between them were unbreakable. So when Jake is brutally murdered and Ryan accused of the crime, her world is shattered. Edie is alone for the first time in years, living in the remote house that she and Jake shared. She is grief-stricken and afraid - with good reason. Because someone is watching. Someone has been waiting for this moment. Now that Edie is alone, the past she tried so hard to leave behind is about to catch up with her...", "price": "21.99", "rating": "3.89", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1633555319l/59230711._SY475_.jpg", "image": "59230711._SY475_.jpg"}}, {"model": "products.product", "pk": 131, "fields": {"category": 14, "sku": "pp5006380260", "name": "Sea of Tranquility", "author": "Emily St. John Mandel", "description": "Edwin St. Andrew is eighteen years old when he crosses the Atlantic by steamship, exiled from polite society following an ill-conceived diatribe at a dinner party. He enters the forest, spellbound by the beauty of the Canadian wilderness, and suddenly hears the notes of a violin echoing in an airship terminal--an experience that shocks him to his core. Two centuries later a famous writer named Olive Llewellyn is on a book tour. She's travelling all over Earth, but her home is the second moon colony, a place of white stone, spired towers, and artificial beauty. Within the text of Olive's bestselling pandemic novel lies a strange passage: a man plays his violin for change in the echoing corridor of an airship terminal as the trees of a forest rise around him. When Gaspery-Jacques Roberts, a detective in the Night City, is hired to investigate an anomaly in the North American wilderness, he uncovers a series of lives upended: The exiled son of an earl driven to madness, a writer trapped far from home as a pandemic ravages Earth, and a childhood friend from the Night City who, like Gaspery himself, has glimpsed the chance to do something extraordinary that will disrupt the timeline of the universe. A virtuoso performance that is as human and tender as it is intellectually playful, Sea of Tranquillity is a novel of time travel and metaphysics that precisely captures the reality of our current moment.", "price": "12.99", "rating": "4.31", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1626710416l/58446227.jpg", "image": "58446227.jpg"}}, {"model": "products.product", "pk": 132, "fields": {"category": 14, "sku": "pp5006380337", "name": "The Candy House", "author": "Arizona Original Bootcut Jeans", "description": "It's 2010. Staggeringly successful and brilliant tech entrepreneur Bix Bouton is desperate for a new idea. He's forty, with four kids, and restless when he stumbles into a conversation with mostly Columbia professors, one of whom is experimenting with downloading or 'externalising' memory. Within a decade, Bix's new technology, Own Your Unconscious—that allows you access to every memory you've ever had, and to share every memory in exchange for access to the memories of others has seduced multitudes. But not everyone. In spellbinding linked narratives, Egan spins out the consequences of Own Your Unconscious through the lives of multiple characters whose paths intersect over several decades. Egan introduces these characters in an astonishing array of styles from omniscient to first person plural to a duet of voices, an epistolary chapter, and a chapter of tweets. In the world of Egan's spectacular imagination, there are 'counters' who track and exploit desires and there are 'eluders,' those who understand the price of taking a bite of the Candy House. Intellectually dazzling and extraordinarily moving, The Candy House is a bold, brilliant imagining of a world that is moments away. With a focus on social media, gaming, and alternate worlds, you can almost experience moving among dimensions in a role-playing game. Egan delivers a fierce and exhilarating testament to the tenacity and transcendence of human longing for real connection, love, family, privacy and redemption.", "price": "14.99", "rating": "3.86", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1642351487l/58437521.jpg", "image": "58437521.jpg"}}, {"model": "products.product", "pk": 133, "fields": {"category": 14, "sku": "pp5006380693", "name": "Portrait of a Thief", "author": "Grace D. Li", "description": "History is told by the conquerors. Across the Western world, museums display the spoils of war, of conquest, of colonialism: priceless pieces of art looted from other countries, kept even now. Will Chen plans to steal them back. A senior at Harvard, Will fits comfortably in his carefully curated roles: a perfect student, an art history major and sometimes artist, the eldest son who has always been his parents' American Dream. But when a mysterious Chinese benefactor reaches out with an impossible and illegal job offer, Will finds himself something else as well: the leader of a heist to steal back five priceless Chinese sculptures, looted from Beijing centuries ago. His crew is every heist archetype one can imag­ine or at least, the closest he can get. A con artist: Irene Chen, a public policy major at Duke who can talk her way out of anything. A thief: Daniel Liang, a premed student with steady hands just as capable of lockpicking as suturing. A getaway driver: Lily Wu, an engineering major who races cars in her free time. A hacker: Alex Huang, an MIT dropout turned Silicon Valley software engineer. Each member of his crew has their own complicated relationship with China and the identity they've cultivated as Chinese Americans, but when Will asks, none of them can turn him down. Because if they succeed? They earn fifty million dollars and a chance to make history. But if they fail, it will mean not just the loss of everything they've dreamed for themselves but yet another thwarted at­tempt to take back what colonialism has stolen. Equal parts beautiful, thoughtful, and thrilling, Portrait of a Thief is a cultural heist and an examination of Chinese American identity, as well as a necessary cri­tique of the lingering effects of colonialism.", "price": "13.99", "rating": "5.00", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1646584666l/57021127._SY475_.jpg", "image": "57021127._SY475_.jpg"}}, {"model": "products.product", "pk": 134, "fields": {"category": 14, "sku": "pp5006390235", "name": "The Younger Wife", "author": "Sally Hepworth", "description": "THE HUSBAND. A heart surgeon at the top of his field, Stephen Aston is getting married again. But first he must divorce his current wife, even though she can no longer speak for herself. THE DAUGHTERS. Tully and Rachel Aston look upon their father's fiancee, Heather, as nothing but an interloper. Heather is younger than both of them. Clearly, she's after their father's money. THE FORMER WIFE. With their mother in a precarious position, Tully and Rachel are determined to get to the truth about their family's secrets, the new wife closing in, and who their father really is. THE YOUNGER WIFE.Heather has secrets of her own. Will getting to the truth unleash the most dangerous impulses in all of them?", "price": "18.99", "rating": "3.94", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1630583980l/57693338.jpg", "image": "57693338.jpg"}}, {"model": "products.product", "pk": 135, "fields": {"category": 14, "sku": "pp5006420202", "name": "The No-Show", "author": "Beth O'Leary", "description": "Siobhan is a quick-tempered life coach with way too much on her plate. Miranda is a tree surgeon used to being treated as just one of the guys on the job. Jane is a soft-spoken volunteer for the local charity shop with zero sense of self-worth. These three women are strangers who have only one thing in common: They've all been stood up on the same day, the very worst day to be stood up--Valentine's Day. And, unbeknownst to them, they've all been stood up by the same man. Once they've each forgiven him for standing them up, they let him back into their lives and are in serious danger of falling in love with a man who seems to have not just one or two but three women on the go....Is there more to him than meets the eye? And will they each untangle the truth before they all get their hearts broken?", "price": "18.99", "rating": "4.15", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1637603058l/58678549.jpg", "image": "58678549.jpg"}}, {"model": "products.product", "pk": 136, "fields": {"category": 14, "sku": "pp5006420400", "name": "Young Mungo", "author": "Douglas Stuart", "description": "Growing up in a housing estate in Glasgow, Mungo and James are born under different stars--Mungo a Protestant and James a Catholic--and they should be sworn enemies if they're to be seen as men at all. Yet against all odds, they become best friends as they find a sanctuary in the pigeon dovecote that James has built for his prize racing birds. As they fall in love, they dream of finding somewhere they belong, while Mungo works hard to hide his true self from all those around him, especially from his big brother Hamish, a local gang leader with a brutal reputation to uphold. And when several months later Mungo's mother sends him on a fishing trip to a loch in Western Scotland with two strange men whose drunken banter belies murky pasts, he will need to summon all his inner strength and courage to try to get back to a place of safety, a place where he and James might still have a future. Imbuing the everyday world of its characters with rich lyricism and giving full voice to people rarely acknowledged in the literary world, Young Mungo is a gripping and revealing story about the bounds of masculinity, the divisions of sectarianism, the violence faced by many queer people, and the dangers of loving someone too much.", "price": "14.99", "rating": "4.46", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1637602267l/58891551.jpg", "image": "58891551.jpg"}}, {"model": "products.product", "pk": 137, "fields": {"category": 14, "sku": "pp5006430031", "name": "Hotel Magnifique", "author": "Emily J. Taylor", "description": "All her life, Jani has dreamed of Elsewhere. Just barely scraping by with her job at a tannery, she's resigned to a dreary life in the port town of Durc, caring for her younger sister Zosa. That is, until the Hotel Magnifique comes to town. The hotel is legendary not only for its whimsical enchantments, but also for its ability to travel appearing in a different destination every morning. While Jani and Zosa can't afford the exorbitant costs of a guest's stay, they can interview to join the staff, and are soon whisked away on the greatest adventure of their lives. But once inside, Jani quickly discovers their contracts are unbreakable and that beneath the marvelous glamour, the hotel is hiding dangerous secrets. With the vexingly handsome doorman Bel as her only ally, Jani embarks on a mission to unravel the mystery of the magic at the heart of the hotel and free Zosa and the other staff from the cruelty of the ruthless maître d'hôtel. To succeed, she'll have to risk everything she loves, but failure would mean a fate far worse than never returning home.", "price": "12.00", "rating": "3.94", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1628095000l/55812605.jpg", "image": "55812605.jpg"}}, {"model": "products.product", "pk": 138, "fields": {"category": 14, "sku": "pp5006462180", "name": "The Wedding Crasher", "author": "Mia Sosa", "description": "Just weeks away from ditching DC for greener pastures, Solange Pereira is roped into helping her wedding planner cousin on a random couple's big day. It's an easy gig... until she stumbles upon a situation that convinces her the pair isn't meant to be. What's a true-blue romantic to do? Crash the wedding, of course. And ensure the unsuspecting groom doesn't make the biggest mistake of his life. Dean Chapman had his future all mapped out. He was about to check off 'start a family' and on track to 'make partner' when his modern day marriage of convenience went up in smoke. Then he learns he might not land an assignment that could be his ticket to a promotion unless he has a significant other and, in a moment of panic, Dean claims to be in love with the woman who crashed his wedding. Oops. Now Dean has a whole new item on his to-do list: beg Solange to be his pretend girlfriend. Solange feels a tiny bit bad about ruining Dean's wedding, so she agrees to play along. Yet as they fake-date their way around town, what started as a performance for Dean's colleagues turns into a connection that neither he nor Solange can deny. Their entire romance is a sham... there's no way these polar opposites could fall in love for real, right?", "price": "16.00", "rating": "3.94", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1627893250l/55506996.jpg", "image": "55506996.jpg"}}, {"model": "products.product", "pk": 139, "fields": {"category": 14, "sku": "pp5006470681", "name": "Memphis", "author": "Tara M. Stringfellow", "description": "In the summer of 1995, ten-year-old Joan, her mother, and her younger sister flee her father's violence, seeking refuge at her mother's ancestral home in Memphis. Half a century ago, Joan's grandfather built this majestic house in the historic Black neighborhood of Douglass--only to be lynched days after becoming the first Black detective in Memphis. This wasn't the first time violence altered the course of Joan's family's trajectory, and she knows it won't be the last. Longing to become an artist, Joan pours her rage and grief into sketching portraits of the women of North Memphis--including their enigmatic neighbour Miss Dawn, who seems to know something about curses. Unfolding over seventy years through a chorus of voices, Memphis weaves back and forth in time to show how the past and future are forever intertwined. It is only when Joan comes to see herself as a continuation of a long matrilineal tradition--and the women in her family as her guides to healing--that she understands that her life does not have to be defined by vengeance. That the sole weapon she needs is her paintbrush.  Inspired by the author's own family history, Memphis--the Black fairy tale she always wanted to read--explores the complexity of what we pass down, not only in our families, but in our country: police brutality and justice, powerlessness and freedom, fate and forgiveness, doubt and faith, sacrifice and love.", "price": "28.99", "rating": "4.30", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1626515519l/52268640.jpg", "image": "52268640.jpg"}}, {"model": "products.product", "pk": 140, "fields": {"category": 15, "sku": "pp5006511030", "name": "Life of Pi", "author": "Yann Martel", "description": "Life of Pi is a fantasy adventure novel by Yann Martel published in 2001. The protagonist, Piscine Molitor 'Pi' Patel, a Tamil boy from Pondicherry, explores issues of spirituality and practicality from an early age. He survives 227 days after a shipwreck while stranded on a boat in the Pacific Ocean with a Bengal tiger named Richard Parker.", "price": "5.99", "rating": "3.93", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1631251689l/4214._SY475_.jpg", "image": "4214._SY475_.jpg"}}, {"model": "products.product", "pk": 141, "fields": {"category": 15, "sku": "pp5006541122", "name": "The Help", "author": "Kathryn Stockett", "description": "Twenty-two-year-old Skeeter has just returned home after graduating from Ole Miss. She may have a degree, but it is 1962, Mississippi, and her mother will not be happy till Skeeter has a ring on her finger. Skeeter would normally find solace with her beloved maid Constantine, the woman who raised her, but Constantine has disappeared and no one will tell Skeeter where she has gone. Aibileen is a black maid, a wise, regal woman raising her seventeenth white child. Something has shifted inside her after the loss of her own son, who died while his bosses looked the other way. She is devoted to the little girl she looks after, though she knows both their hearts may be broken. Minny, Aibileen's best friend, is short, fat, and perhaps the sassiest woman in Mississippi. She can cook like nobody's business, but she can't mind her tongue, so she's lost yet another job. Minny finally finds a position working for someone too new to town to know her reputation. But her new boss has secrets of her own. Seemingly as different from one another as can be, these women will nonetheless come together for a clandestine project that will put them all at risk. And why? Because they are suffocating within the lines that define their town and their times. And sometimes lines are made to be crossed. In pitch-perfect voices, Kathryn Stockett creates three extraordinary women whose determination to start a movement of their own forever changes a town, and the way women, mothers, daughters, caregivers, friends, view one another. A deeply moving novel filled with poignancy, humour, and hope, The Help is a timeless and universal story about the lines we abide by, and the ones we don't.", "price": "5.99", "rating": "4.50", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1622355533l/4667024._SY475_.jpg", "image": "4667024._SY475_.jpg"}}, {"model": "products.product", "pk": 142, "fields": {"category": 15, "sku": "pp5006590111", "name": "Water for Elephants", "author": "Sara Gruen", "description": "An atmospheric, gritty, and compelling novel of star-crossed lovers, set in the circus world circa 1932, by the bestselling author of Riding Lessons. When Jacob Jankowski, recently orphaned and suddenly adrift, jumps onto a passing train, he enters a world of freaks, drifters, and misfits, a second-rate circus struggling to survive during the Great Depression, making one-night stands in town after endless town. A veterinary student who almost earned his degree, Jacob is put in charge of caring for the circus menagerie. It is there that he meets Marlena, the beautiful young star of the equestrian act, who is married to August, the charismatic but twisted animal trainer. He also meets Rosie, an elephant who seems untrainable until he discovers a way to reach her. Beautifully written, Water for Elephants is illuminated by a wonderful sense of time and place. It tells a story of a love between two people that overcomes incredible odds in a world in which even love is a luxury that few can afford.", "price": "4.99", "rating": "4.10", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1494428973l/43641._SY475_.jpg", "image": "43641._SY475_.jpg"}}, {"model": "products.product", "pk": 143, "fields": {"category": 15, "sku": "pp5006590213", "name": "The Lovely Bones", "author": "Alice Sebold", "description": "My name was Salmon, like the fish; first name, Susie. I was fourteen when I was murdered on December 6, 1973. So begins the story of Susie Salmon, who is adjusting to her new home in heaven, a place that is not at all what she expected, even as she is watching life on earth continue without her -- her friends trading rumours about her disappearance, her killer trying to cover his tracks, her grief-stricken family unravelling. Out of unspeakable tragedy and loss, The Lovely Bones succeeds, miraculously, in building a tale filled with hope, humour, suspense, even joy.", "price": "10.99", "rating": "3.83", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1457810586l/12232938.jpg", "image": "12232938.jpg"}}, {"model": "products.product", "pk": 144, "fields": {"category": 15, "sku": "pp5006590221", "name": "Gone Girl", "author": "Gillian Flynn", "description": "On a warm summer morning in North Carthage, Missouri, it is Nick and Amy Dunne's fifth wedding anniversary. Presents are being wrapped and reservations are being made when Nick's clever and beautiful wife disappears from their rented McMansion on the Mississippi River. Husband-of-the-Year Nick isn't doing himself any favors with cringe-worthy daydreams about the slope and shape of his wife's head, but passages from Amy's diary reveal the alpha-girl perfectionist could have put anyone dangerously on edge. Under mounting pressure from the police and the media—as well as Amy's fiercely doting parents the town golden boy parades an endless series of lies, deceits, and inappropriate behaviour. Nick is oddly evasive, and he's definitely bitter but is he really a killer? As the cops close in, every couple in town is soon wondering how well they know the one that they love. With his twin sister, Margo, at his side, Nick stands by his innocence. Trouble is, if Nick didn't do it, where is that beautiful wife? And what was in that silvery gift box hidden in the back of her bedroom closet? With her razor-sharp writing and trademark psychological insight, Gillian Flynn delivers a fast-paced, devilishly dark, and ingeniously plotted thriller that confirms her status as one of the hottest writers around. One of the most critically acclaimed suspense writers of our time, New York Times bestseller Gillian Flynn takes that statement to its darkest place in this unputdownable masterpiece about a marriage gone terribly, terribly wrong. The Chicago Tribune proclaimed that her work 'draws you in and keeps you reading with the force of a pure but nasty addiction.' Gone Girl's toxic mix of sharp-edged wit and deliciously chilling prose creates a nerve-fraying thriller that confounds you at every turn.", "price": "12.99", "rating": "4.10", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1554086139l/19288043.jpg", "image": "19288043.jpg"}}, {"model": "products.product", "pk": 145, "fields": {"category": 15, "sku": "pp5006620412", "name": "The Girl on the Train", "author": "Paula Hawkins", "description": "Rachel catches the same commuter train every morning. She knows it will wait at the same signal each time, overlooking a row of back gardens. She's even started to feel like she knows the people who live in one of the houses. 'Jess and Jason,' she calls them. Their life as she sees it is perfect. If only Rachel could be that happy. And then she sees something shocking. It's only a minute until the train moves on, but it's enough. Now everything's changed. Now Rachel has a chance to become a part of the lives she's only watched from afar. Now they'll see; she's much more than just the girl on the train...", "price": "13.99", "rating": "3.95", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1574805682l/22557272.jpg", "image": "22557272.jpg"}}, {"model": "products.product", "pk": 146, "fields": {"category": 15, "sku": "pp5006640930", "name": "The Final Girl Support Group", "author": "Grady Hendrix", "description": "A fast-paced, thrilling horror novel that follows a group of heroines to die for, from the brilliant New York Times bestselling author of The Southern Book Club's Guide to Slaying Vampires. In horror movies, the final girl is the one who's left standing when the credits roll. The one who fought back, defeated the killer, and avenged her friends. The one who emerges bloodied but victorious. But after the sirens fade and the audience moves on, what happens to her? Lynnette Tarkington is a real-life final girl who survived a massacre twenty-two years ago, and it has defined every day of her life since. And she's not alone. For more than a decade she's been meeting with five other actual final girls and their therapist in a support group for those who survived the unthinkable, putting their lives back together, piece by piece. That is until one of the women misses a meeting and Lynnette's worst fears are realised--someone knows about the group and is determined to take their lives apart again, piece by piece. But the thing about these final girls is that they have each other now, and no matter how bad the odds, how dark the night, how sharp the knife, they will never, ever give up.", "price": "9.99", "rating": "4.70", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1614275199l/55829194.jpg", "image": "55829194.jpg"}}, {"model": "products.product", "pk": 147, "fields": {"category": 15, "sku": "pp5006660007", "name": "The Spanish Love Deception", "author": "Elena Armas", "description": "Catalina Martin desperately needs a date to her sister's wedding. Especially since her little white lie about her American boyfriend has spiralled out of control. Now everyone she knows including her ex and his fiancee will be there and eager to meet him. She only has four weeks to find someone willing to cross the Atlantic and aid in her deception. New York to Spain is no short flight and her raucous family won't be easy to fool. Enter Aaron Blackford her tall, handsome, condescending colleague who surprisingly offers to step in. She'd rather refuse; never has there been a more aggravating, blood-boiling, and insufferable man. But Catalina is desperate, and as the wedding draws nearer, Aaron looks like her best option. And she begins to realise he might not be as terrible in the real world as he is at the office.", "price": "9.99", "rating": "4.09", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1614122544l/57190892._SY475_.jpg", "image": "57190892._SY475_.jpg"}}, {"model": "products.product", "pk": 148, "fields": {"category": 15, "sku": "pp5006750455", "name": "The Anthropocene Reviewed", "author": "John Green", "description": "The Anthropocene is the current geological age, in which human activity has profoundly shaped the planet and its biodiversity. In this remarkable symphony of essays adapted and expanded from his ground-breaking, critically acclaimed podcast, John Green reviews different facets of the human-centred planet - from the QWERTY keyboard and Halley's Comet to Penguins of Madagascar - on a five-star scale. Complex and rich with detail, the Anthropocene's reviews have been praised as 'observations that double as exercises in memoiristic empathy', with over 10 million lifetime downloads. John Green's gift for storytelling shines throughout this artfully curated collection about the shared human experience; it includes beloved essays along with six all-new pieces exclusive to the book.", "price": "9.99", "rating": "4.41", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1616514130l/55145261.jpg", "image": "55145261.jpg"}}, {"model": "products.product", "pk": 149, "fields": {"category": 15, "sku": "pp5006790372", "name": "Call Me Athena: Girl from Detroit", "author": "Colby Cedar Smith", "description": "Call Me Athena: Girl from Detroit is a beautifully written novel in verse loosely based on author Colby Cedar Smith's paternal grandmother. The story follows Mary as the American-born daughter of Greek and French immigrants living in Detroit in the 1930s, creating a historically accurate portrayal of life as an immigrant during the Great Depression, hunger strikes, and violent riots. Mary lives in a tiny apartment with her immigrant parents, her brothers, and her twin sister, and she questions why her parents ever came to America. She yearns for true love, to own her own business, and to be an independent, modern American woman much to the chagrin of her parents, who want her to be a 'good Greek girl.' Mary's story is peppered with flashbacks to her parents' childhoods in Greece and northern France; their stories connect with Mary as they address issues of arranged marriage, learning about independence, and yearning to grow beyond one's own culture. Though Call Me Athena is written from the perspective of three profoundly different narrators, it has a wide-reaching message: It takes courage to fight for tradition and heritage, as well as freedom, love, and equality.", "price": "6.99", "rating": "5.00", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1607456965l/54482759._SX318_.jpg", "image": "54482759._SX318_.jpg"}}, {"model": "products.product", "pk": 150, "fields": {"category": 15, "sku": "pp5006790745", "name": "Black Girl, Call Home", "author": " Jasmine Mans", "description": "From spoken word poet Jasmine Mans comes an unforgettable poetry collection about race, feminism, and queer identity. With echoes of Gwendolyn Brooks and Sonia Sanchez, Mans writes to call herself and us home. Each poem explores what it means to be a daughter of Newark, and America--and the painful, joyous path to adulthood as a young, queer Black woman.Black Girl, Call Home is a love letter to the wandering Black girl and a vital companion to any woman on a journey to find truth, belonging, and healing.", "price": "8.99", "rating": "4.45", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1605310476l/54359466.jpg", "image": "54359466.jpg"}}, {"model": "products.product", "pk": 151, "fields": {"category": 3, "sku": "pp50060820123", "name": "Beautiful World, Where Are You", "author": "Sally Rooney", "description": "Alice, a novelist, meets Felix, who works in a warehouse, and asks him if he’d like to travel to Rome with her. In Dublin, her best friend, Eileen, is getting over a break-up and slips back into flirting with Simon, a man she has known since childhood. Alice, Felix, Eileen, and Simon are still young—but life is catching up with them. They desire each other, they delude each other, they get together, they break apart. They have sex, they worry about sex, they worry about their friendships and the world they live in. Are they standing in the last lighted room before the darkness, bearing witness to something? Will they find a way to believe in a beautiful world?", "price": "12.99", "rating": "3.64", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1618329605l/56597885.jpg", "image": "56597885.jpg"}}, {"model": "products.product", "pk": 152, "fields": {"category": 1, "sku": "pp50060820111", "name": "The League of Gentlewomen Witches", "author": "India Holton", "description": "Miss Charlotte Pettifer belongs to a secret league of women skilled in the subtle arts. That is to say—although it must never be said—witchcraft. The League of Gentlewomen Witches strives to improve the world in small ways. Using magic, they tidy, correct, and manipulate according to their notions of what is proper, entirely unlike those reprobates in the Wisteria Society.\r\n\r\nWhen the long lost amulet of Black Beryl is discovered, it is up to Charlotte, as the future leader of the League, to make sure the powerful talisman does not fall into the wrong hands. Therefore, it is most unfortunate when she crosses paths with Alex O'Riley, a pirate who is no Mr. Darcy. With all the world scrambling after the amulet, Alex and Charlotte join forces to steal it together. If only they could keep their pickpocketing hands to themselves! If Alex's not careful, he might just steal something else—such as Charlotte's heart.", "price": "10.99", "rating": "4.19", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1628691906l/58395042.jpg", "image": "58395042.jpg"}}, {"model": "products.product", "pk": 153, "fields": {"category": 1, "sku": "pp50066401211", "name": "The Next Thing You Know", "author": "Jessica Strawser", "description": "A musician facing the untimely end of his career. An end-of-life doula with everything, and nothing, to lose. A Star Is Born meets Me Before You in this powerful novel by the author of A Million Reasons Why.\r\n\r\nAs an end-of-life doula, Nova Huston’s job—her calling, her purpose, her life—is to help terminally ill people make peace with their impending death. Unlike her business partner, who swears by her system of checklists, free-spirited Nova doesn’t shy away from difficult clients: the ones who are heartbreakingly young, or prickly, or desperate for a caregiver or companion.\r\n\r\nWhen Mason Shaylor shows up at her door, Nova doesn’t recognize him as the indie-favorite singer-songwriter who recently vanished from the public eye. She knows only what he’s told her: That life as he knows it is over. His deteriorating condition makes playing his guitar physically impossible—as far as Mason is concerned, he might as well be dead already.\r\n\r\nExcept he doesn’t know how to say goodbye.\r\n\r\nHelping him is Nova’s biggest challenge yet. She knows she should keep clients at arm’s length. But she and Mason have more in common than anyone could guess… and meeting him might turn out to be the hardest, best thing that’s ever happened to them both.\r\n\r\nThe Next Thing You Know is an emotional, resonant story about the power of human connection, love when you least expect it, hope against the odds, and what it really takes to live life with no regrets.", "price": "12.99", "rating": "4.30", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1641777690l/57693379.jpg", "image": "57693379.jpg"}}, {"model": "products.product", "pk": 154, "fields": {"category": 1, "sku": "pp50052", "name": "Foretold", "author": "L.H. Cosway", "description": "Darya Cristescu is a bad witch.\r\n\r\nAttending St. Bastian’s Institute for Magic and the Supernatural is no fun when you’re terrible at spells. She’d much prefer to leave the magic to her classmates, but sadly, Darya has her final year to complete. She’s hoping to keep her head down and graduate, however life has other plans.\r\n\r\nOne of her teachers has been shockingly murdered and everyone thinks she did it. Well, not everyone. Peter Girard, the warlock she’s spent years secretly pining for, knows she’s innocent. Unfortunately, there’s enough bad blood between their families to rival the Montagues and the Capulets, which makes being allies complicated.\r\n\r\nIn an effort to find the true killer, Darya asks Peter to help her cast a spell. But her ineptitude with magic leaves them with an unintended consequence. Darya’s and Peter’s minds have become magically fused, allowing them to communicate telepathically.\r\n\r\nAll this would be stressful enough if it weren’t for the fact that a demon has marked Darya and she has no idea why. As she and Peter try to discover who the demon is, their unexpected alliance brings about feelings neither of them could’ve anticipated.", "price": "12.99", "rating": "3.45", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1634722600l/58120459._SY475_.jpg", "image": "58120459._SY475_.jpg"}}, {"model": "products.product", "pk": 155, "fields": {"category": 1, "sku": "pp5006", "name": "Parks and Provocation", "author": "Juliette Cross", "description": "Lola Landry stares through the window of her locked car with the keys in the ignition and the radio blaring Beck’s “Loser.” While standing there and sweltering in the soupy Tennessee humidity, she wonders how her orderly life had crashed and burned so badly. Then her high school nemesis saunters up in all of his tall, strapping, fireman-to-the-rescue glory, slapping her with the humiliating proof that it can always get worse.\r\n\r\nWhen the uber-confident Jedediah Lawson requests a date in return for popping her lock, a lightbulb goes off. Revenge is sweet. He would make the perfect victim—guest, that is—for her next podcast episode on Kiss and Tell. What shocks her is the casual way he not only agrees to the post-date interview on air, but ends up hijacking her audience and wooing them with his swoony, southern charm. Not even a low score on the date-o-meter can dissuade the man or keep her fans from demanding more of the charismatic Jed.\r\n\r\nWhat’s worse, she secretly wants a second date with this man who is so different from his teenage self. His unwavering patience and dimpled smile erodes her will, until she breaks the Kiss and Tell rules by agreeing to a second…and a third date. It’s a disaster. Not the date. They’re wonderful. The disaster is that she is falling for a man she once dubbed Jockstrap Jed.", "price": "10.99", "rating": "4.50", "image_url": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1646245678l/60533221.jpg", "image": "60533221.jpg"}}]